{
  "charities" : {
    "org10037" : {
      "-KeaVWMuwWGdL-MpJzCI" : {
        "-KeqLHuef8j7DatROW8R" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIDWVGs1ACRp8_ZfL9" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "nrawc.org",
        "id" : "org10037.htm",
        "mission_statement" : "The NRA Special Contribution Fund provides education and training in firearms safety, marksmanship, and wildlife conservation via the NRA Whittington Center, which covers 33,000 acres near Raton, New Mexico. Founded in 1973, the Whittington Center is the most comprehensive shooting facility in America today. In 2007 the Whittington Center was visited by over 183,000 unique visitors. Events in 2007 included clinics, tournaments, matches, guided and unguided hunts, nature trail rides, and Adventure Camp for junior outdoors enthusiasts. ",
        "name" : "NRA Special Contribution Fund, Whittington Center",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.nrawc.org"
      }
    },
    "org10213" : {
      "-KeaVW0WSoiCsq62lvmh" : {
        "-KeqKtBW6MrKuEWuYN1i" : {
          "Michael" : "not_homeless_related"
        },
        "-KeqLIbtPWYQpN1GJ3Bo" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIDZtCxROiS_tjOKAb" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "blindchildrenscenter.org",
        "id" : "org10213.htm",
        "mission_statement" : "The Blind Childrens Center's mission is to foster the development and education of children - birth through 2nd grade - who are visually impaired in an inclusive, family-focused setting. The Center was founded in 1938 by Southern California Delta Gammas. Each year the Center serves approximately 100 children who are blind or visually impaired and provides an array of support services for more than 350 family members. Our goal is to provide a comprehensive program of specialized education and training which will optimize our students' development and consequent opportunities to lead a meaningful and productive life. We are committed to a family-focused approach where parents, siblings, grandparents, and caregivers are included in the educational process every step of the way. In keeping with best practices, our programs are fully inclusive with sighted children integrated in each class, providing unique opportunities for social interaction and acquisition of critical skills. ",
        "name" : "Blind Childrens Center",
        "rater" : "n,Michael,MichaelHo,Ceren",
        "type" : "Human Services : Social Services",
        "url" : "http://www.blindchildrenscenter.org"
      }
    },
    "org10245" : {
      "-KeaVWASLI3Y2PaxSiWL" : {
        "-KeqL3a8sgPXXKsbCJEw" : {
          "Michael" : "not_homeless_related"
        },
        "-KeqLJbd6N6dAzaw6xJV" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIDavtpqSM1S9iU8fH" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "in-sight.org",
        "id" : "org10245.htm",
        "mission_statement" : "INSIGHT works to inspire confidence, build skills, and empower people who are blind and visually impaired to become full integrated, equally valued members of society by providing diverse services that produce opportunities and choices. Vision rehabilitation is the key piece of INSIGHT's mission of inspiring confidence, building skills, and empowering people who are blind and visually impaired. Our team of trained professionals work with people to identify their needs, interests, and goals and then establish an action plan that may include a low vision assessment, rehabilitation training classes, or computer classes. INSIGHT Radio is a unique, closed-circuit radio reading service that keeps people who are print disabled informed and entertained throughout the day. ",
        "name" : "INSIGHT",
        "rater" : "n,Michael,MichaelHo,Ceren",
        "type" : "Human Services : Social Services",
        "url" : "http://www.in-sight.org/"
      }
    },
    "org10410" : {
      "-KeaVVQNMmIQl4gCQ1_o" : {
        "-KeqL7eWFrSaW_Iiv-Qa" : {
          "Michael" : "not_homeless_related"
        },
        "-KeqLLANiyt7NpUuoJ6R" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIDd2-b7JdyAshxTpQ" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "kidneymd.org",
        "id" : "org10410.htm",
        "mission_statement" : "The National Kidney Foundation of Maryland is dedicated to preventing kidney and urinary tract diseases, improving the health and well-being of individuals and families affected by these diseases and increasing the availability of all organs for transplantation. ",
        "name" : "National Kidney Foundation of Maryland",
        "rater" : "n,Michael,MichaelHo,Ceren",
        "type" : "Health : Diseases, Disorders, and Disciplines",
        "url" : "http://www.kidneymd.org"
      }
    },
    "org10419" : {
      "-KeaVVKXzkU5pxPNsqIe" : {
        "-KeqLBUlyZwHCYY1oruK" : {
          "Michael" : "not_homeless_related"
        },
        "-KeqLN0VL0RlxCrpbHAN" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIF_rZhfIEA6NTbMyN" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "safekids.org",
        "id" : "org10419.htm",
        "mission_statement" : "Safe Kids Worldwide is a nonprofit organization working to prevent childhood injury, the number one killer of children in the United States. Throughout the world, almost one million children die of an injury each year, and almost every one of these tragedies is preventable. Safe Kids works with an extensive network of more than 500 coalitions in the U.S. and with partners in more than 25 countries to reduce traffic injuries, drownings, falls, burns, poisonings and more. Since 1988, Safe Kids has helped reduce the U.S. childhood death rate from unintentional injury by 56 percent. Working together, we can do much more for kids everywhere. ",
        "name" : "Safe Kids Worldwide",
        "rater" : "n,Michael,MichaelHo,Ceren",
        "type" : "Health : Patient and Family Support",
        "url" : "http://www.safekids.org"
      }
    },
    "org10465" : {
      "-KeaVVJrSRF9pbrYYS9K" : {
        "-KeqMk0G4y3GL8N7ScC5" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIFal2kGOEjLeAOKSM" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "thesymphony.org",
        "id" : "org10465.htm",
        "mission_statement" : "The mission of the Santa Barbara Symphony Orchestra Association is twofold: to be a highly respected symphony orchestra, performing great works with passion and excellence and an indispensable partner to our community, providing enrichment through inspiring concerts, music education programs and access for all. The Santa Barbara Symphony Orchestra Association was founded in 1953 on the belief that a special city deserves a special Orchestra. Throughout more than half a century of glorious history, the Symphony has been celebrated for a unique ability to deliver brilliant orchestral concerts while maintaining a strong commitment to education and community engagement. ",
        "name" : "Santa Barbara Symphony Orchestra Association",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://www.thesymphony.org"
      }
    },
    "org10503" : {
      "-KeaVWp3CUDRA915oDgx" : {
        "-KeqMnFdqlQaY-2190ZT" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIFeXj8J1_Ik9ZvEEx" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "imow.org",
        "id" : "org10503.htm",
        "mission_statement" : "MISSION: The mission of the International Museum of Women is to inspire creativity, awareness and action on vital global issues for women.WHO WE ARE: The International Museum of Women (IMOW) is an innovative online museum based in San Francisco. IMOW reaches a truly global community, with exhibitions that attract 600,000 annual visitors from more than 200 countries and territories worldwide. IMOW is governed by a Board of Directors of business and community leaders, and receives strategic guidance from a Global Council of international leaders.WHAT WE DO: IMOW is a museum without walls that curates multimedia online exhibitions and temporary physical installations around the world; develops toolkits for educators; and hosts public programs featuring world-class authors, artists, and political leaders. ",
        "name" : "International Museum of Women",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://www.imow.org"
      }
    },
    "org10556" : {
      "-KeaVW_bIIxuZJPJRm8V" : {
        "-KeqMtjWFEIelaM42NV6" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIFmuQqrWmfXUYUyJG" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "cascadeaids.org",
        "id" : "org10556.htm",
        "mission_statement" : "Cascade AIDS Project (CAP) is the oldest and largest AIDS Service Organization serving Oregon and SW Washington. We operate with a mission to prevent HIV infections, support and empower people affected and infected by HIV/AIDS, and eliminate HIV/AIDS related stigma.     CAP offers a broad array of services through our two program departments, Support Services and Prevention & Education. Within Support Services our program offerings include emergency, short-term and long-term housing support for people infected and affected by HIV/AIDS, as well as psycho-social support, employment counseling, and support for kids and families.     Within Prevention & Education our program offerings include HIV and STD counseling and testing services; prevention, education and outreach to high-risk populations including communities of color, youth and gay and bisexual men; and a drop-in center offering culturally appropriate prevention and education services for gay and bisexual men.    ",
        "name" : "Cascade AIDS Project",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Health : Diseases, Disorders, and Disciplines",
        "url" : "http://www.cascadeaids.org"
      }
    },
    "org10574" : {
      "-KeaVW5xPUqeD0uU6awp" : {
        "-KeqMy2tSt9n4HrQxIam" : {
          "MichaelHo" : "homeless_related"
        },
        "-KfIFpQk0C1v_GYGcnCF" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "jewishlongbeach.org",
        "id" : "org10574.htm",
        "mission_statement" : "The Jewish Federation of Greater Long Beach and West Orange County anchor the Jewish Community Partnership. Since 1948, the Jewish Federation has worked to preserve Jewish life and strengthen Jewish advocacy, while also providing assistance to people in need and at risk, where they are. Collaborating with individuals and across the community, we connect those who want help to those who need it most. More than fundraisers, we are expert facilitators who identify, convene and nourish the critical partners, programs and services that touch thousands of lives, every day. In your neighborhood, your country, and around the world. ",
        "name" : "Jewish Federation of Greater Long Beach and West Orange County",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.jewishlongbeach.org/"
      }
    },
    "org10668" : {
      "-KeaVVpaR4XJWAnwlLso" : {
        "-KeqN1Z0-3UuiELOjhp4" : {
          "MichaelHo" : "homeless_related"
        },
        "-KfIG-Cj0W4z_sdKlbAG" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "shnativity.org",
        "id" : "org10668.htm",
        "mission_statement" : "Sacred Heart Nativity School (SHNS) strives to afford our students with one of the most important opportunities - a high quality Catholic education. SHNS is dedicated to providing quality, low-cost private education to at-risk youth in the 6th through 8th grades. It is an academically challenging and a highly structured environment. These youth, 96% Latino, are in danger of dropping out of school and risking a lifetime of poor outcomes. At SHNS our students benefit from a rich and integrated environment where they learn not only reading, math and science, but also the importance of hard work, ethical leadership, compassion for others and responsible citizenship. ",
        "name" : "Sacred Heart Nativity School",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Education : Private Elementary and Secondary Schools",
        "url" : "http://www.shnativity.org"
      }
    },
    "org10688" : {
      "-KeaVV26CVeSs97BHoTs" : {
        "-KeqN4ztYJCsGr4orCkh" : {
          "MichaelHo" : "homeless_related"
        },
        "-KfIG3SMUyctUdnVki3P" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "brevardhabitat.com",
        "id" : "org10688.htm",
        "mission_statement" : "Seeking to put God's love into action, Habitat for Humanity brings people together to build homes, communities and hope.  ",
        "name" : "Habitat for Humanity of Brevard County",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "http://www.brevardhabitat.com/"
      }
    },
    "org10746" : {
      "-KeaVVS27zIV4w_Vm9_n" : {
        "-KeqNEHcU7xEeacYJgUp" : {
          "MichaelHo" : "homeless_related"
        },
        "-KfIGBM7Q6GzHnSJsSnf" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "mowsf.org",
        "id" : "org10746.htm",
        "mission_statement" : "Meals On Wheels San Francisco (MOWSF) exists to alleviate the food insecurity and loneliness experienced by seniors who want to stay in their own home but cannot shop or prepare meals for themselves. Our services are geared towards serving those with the greatest physical, social and economic need. The seniors we serve are frail, have limited ability to purchase or prepare meals, and have little or no support from family or caregivers. All of our clients are physically challenged due to a variety of conditions such as heart disease, cancer, vision loss, arthritis and diabetes. They are also confronted with the anxiety that the cost of living in San Francisco could outweigh their limited income. We serve more than one million meals per year. ",
        "name" : "Meals On Wheels of San Francisco",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Human Services : Social Services",
        "url" : "http://mowsf.org"
      }
    },
    "org10811" : {
      "-KeaVUg1bItnFOJupiIN" : {
        "-KeqNQ7VO5CFr3PE6ogR" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIKB0uNSW_yH2bv9fm" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "collegetrack.org",
        "id" : "org10811.htm",
        "mission_statement" : "College Track is the catalyst for change for under-resourced high school students who are motivated to earn a college degree. Since its inception, College Track has grown each year, strengthening its services and expanding its program to support more and more students. College Track is an after-school, college preparatory program. Through our center-based approach and core service areas, College Track has created a culture of high expectations. We ensure that each student is college ready and provide support that many students do not have in their homes or at their schools. Together, these components make a powerful, comprehensive program that empowers students to achieve their dream of a college education. ",
        "name" : "College Track",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.collegetrack.org/"
      }
    },
    "org10960" : {
      "-KeaVVbNjdewTeHtUzYd" : {
        "-KeqNUg8V3qHZ22GyBn5" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIKDvU-aiVN7F5_hWa" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "mycampsunshine.com",
        "id" : "org10960.htm",
        "mission_statement" : "Founded in 1982, Camp Sunshine enriches the lives of Georgia's children with cancer and their families through recreational, educational and support programs. Camp Sunshine provides year-round programs which allow children with cancer and their families to share similar experiences and to participate in activities that promote normal childhood development as they cope with the challenges of childhood cancer.  Although Camp Sunshine began as a summer camp, programs now also include family camps, sibling camp, teen retreats, preschool and school age programs, support and educational programs for families, hospital based camp and a variety of activities throughout the year.  ",
        "name" : "Camp Sunshine, Georgia",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Health : Patient and Family Support",
        "url" : "http://www.mycampsunshine.com/"
      }
    },
    "org11028" : {
      "-KeaVSrCHRf65xD1WChj" : {
        "-KeqNZMFvuVgiixFj6zo" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIKFgb-DZ62-ocEMFV" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "georgiahistory.com",
        "id" : "org11028.htm",
        "mission_statement" : "Georgia Historical Society (GHS) is the premier independent statewide institution responsible for collecting, examining, and teaching Georgia history. GHS houses the oldest and most distinguished collection of materials related exclusively to Georgia history in the nation.     Chartered by the Georgia General Assembly in 1839, the Georgia Historical Society (GHS) is the state's oldest cultural organization and first and only statewide historical society. GHS is an educational and research institution created to preserve and interpret Georgia history and the state's role in American history through a variety of educational programs, publications, and research services. Headquartered in Savannah with an office in Atlanta, GHS has 6,000 individual members and nearly 200 affiliate chapters. ",
        "name" : "Georgia Historical Society",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Arts, Culture, Humanities : Libraries, Historical Societies and Landmark Preservation",
        "url" : "http://www.georgiahistory.com"
      }
    },
    "org11047" : {
      "-KeaVWTaO6t9dz2HQKd5" : {
        "-KeqNa_-OjOF-N2NDYe6" : {
          "MichaelHo" : "homeless_related"
        },
        "-KfIKHJSZd1a_jtdNMWE" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "ougm.org",
        "id" : "org11047.htm",
        "mission_statement" : "The Olympia Union Gospel Mission began its work with the homeless and needy in 1995 through a street ministry outreach. Sandwiches and hot drinks were offered in an atmosphere of love and acceptance. Our goal was and still is to share God's love in practical ways. Today, the Olympia Union Gospel Mission has numerous programs. Hundreds of men and women are served each week and OUGM is still sharing God's love in practical ways. At the same time, we work to help individuals break the cycle of homelessness and poverty. Meals, hygiene and addiction recovery services are ways we reach out to make a difference in people's lives. Hot meals is one of the most powerful tools for sharing the Gospel with people in need because food is a tangible way to show God's love (Luke 10:27). ",
        "name" : "Olympia Union Gospel Mission",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Human Services : Homeless Services",
        "url" : "http://ougm.org/"
      }
    },
    "org11061" : {
      "-KeaVWqeTHHT7Ot2kdsc" : {
        "-Keqa0qc9mcOmIGM6ZYE" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIKLYPHN4ajXqvkSon" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "thewomensfoundation.org",
        "id" : "org11061.htm",
        "mission_statement" : "Founded in 1998, Washington Area Women's Foundation transforms the lives of women and girls, the Washington region and the world. The Foundation connects the DC area with the global movement that recognizes that promoting women's and girl's prosperity is key to stronger, more resilient and healthier communities. We believe in the promise and value of every women and girl in the Washington area because we know that when they achieve their full potential, our entire region benefits. In 2011, The Women's Foundation responded to the continuing national economic crisis and increase in local poverty by sharpening its focus on the economic security of women and girls. The Foundation wanted to ensure that our community's collective resources are focused on the intersection of where there is the most need and where we can have the most impact. ",
        "name" : "Washington Area Women's Foundation",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.thewomensfoundation.org"
      }
    },
    "org11072" : {
      "-KeaVW51cJHS035UnTih" : {
        "-Keqa4v_BzzThciUDEa1" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIKNQOuaJ0IFFCSI-K" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "freetobreathe.org",
        "id" : "org11072.htm",
        "mission_statement" : "Free to Breathe has undertaken the bold, yet attainable, goal of doubling the survival rate of those diagnosed with lung cancer by 2022. Comprised of lung cancer survivors, leading medical practitioners, respected research authorities, advocates and other industry leaders, Free to Breathe is a representative of those affected by and fighting for a cure for lung cancer. Free to Breathe utilizes a multifaceted approach of funding cutting edge research, providing information on current treatment options and ensuring patients benefit from innovative therapies. Through its work, Free to Breathe provides the thousands diagnosed with lung cancer each year the hope of an eventual cure. ",
        "name" : "Free to Breathe",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Health : Diseases, Disorders, and Disciplines",
        "url" : "http://www.freetobreathe.org/"
      }
    },
    "org11096" : {
      "-KeaVU_w97IJ2JA1BpdX" : {
        "-KeqaCZSXubSJp3k4w3T" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIKTp1oGvIprfVvb1h" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "timmyglobalhealth.org",
        "id" : "org11096.htm",
        "mission_statement" : "Timmy Global Health expands access to healthcare and empowers students and volunteers to tackle today's most pressing global health challenges. To achieve this goal, Timmy sends medical service teams to support the work of international partner organizations, channels financial, medical, and human resources to community based health and development projects, and works to empower students at U.S. high schools and colleges to fundraise, advocate, and serve in an effort to fight health disparities at home and abroad. ",
        "name" : "Timmy Global Health",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "International : Development and Relief Services",
        "url" : "http://www.timmyglobalhealth.org"
      }
    },
    "org11103" : {
      "-KeaVWZ0HqwzW5HuskmW" : {
        "-KeqaUZh2_rhokCKqKMc" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIKy8RNuHqEEiQs-Wo" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "ocma.net",
        "id" : "org11103.htm",
        "mission_statement" : "The Orange County Museum of Art is the premier visual arts organization in Orange County, California, serving a population of nearly three million residents in one of the fastest-growing metropolitan areas in the country. Critically acclaimed exhibitions such as Picasso to Pollock: Modern Masterpieces from the Wadsworth Atheneum Museum of Art, Mary Heilmann: To Be Someone, and Birth of the Cool: Art Design, and Culture at Midcentury, draw more than 40,000 visitors annually. Some 15,000 children and adults participate in award winning education programs. The museum's collection comprises nearly 2,500 objects, with a concentration on the art of California from the early 20th century to present. ",
        "name" : "Orange County Museum of Art",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://www.ocma.net"
      }
    },
    "org11132" : {
      "-KeaVWcSPsBuOBVtTD-M" : {
        "-KeqaXSv71U4kbbHJsHZ" : {
          "MichaelHo" : "homeless_related"
        },
        "-KfIL-81E0NVrLkBScoL" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "tgpdenver.org",
        "id" : "org11132.htm",
        "mission_statement" : "The Gathering Place (TGP) is metropolitan Denver's only daytime drop-in center for women, children, and transgender individuals who are experiencing homelessness or poverty. In addition to providing a safe refuge, TGP services and programs meet basic needs and provide resources for personal growth. TGP serves some of the most vulnerable in Denver and they tend to face a complex set of circumstances (e.g., unsafe living situations, physical or mental health issues, disabilities, lack of access to resources or technology). To meet as many needs as possible, TGP is many things to many people. To the mother interested in earning a GED, TGP is a place to study while her kids play in the family area. To the artist who needs to earn some cash, TGP is The Card Project. To the woman dealing with health issues and barely able to make ends meet, TGP is a trusted source for nutritious meals. To the newly homeless woman, TGP is a safe refuge where she can begin to rebuild. ",
        "name" : "The Gathering Place, Denver",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Human Services : Homeless Services",
        "url" : "http://www.tgpdenver.org/"
      }
    },
    "org11158" : {
      "-KeaVWBHcWaIWMa4JNoK" : {
        "-KeqaaJXVBst38e7WbWW" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIL1oUzErofiEYkJut" : {
          "Ceren" : "not_homeless_related"
        },
        "domain" : "firehero.org",
        "id" : "org11158.htm",
        "mission_statement" : "The United States Congress created the National Fallen Firefighters Foundation to lead a nationwide effort to remember America's fallen firefighters. Since 1992, the Foundation has developed and expanded programs to honor our fallen fire heroes and assist their families and coworkers. Since 1992, the Foundation has developed and expanded programs that fulfill that mandate. Our mission is to honor and remember America's fallen fire heroes and to provide resources to assist their survivors in rebuilding their lives. ",
        "name" : "National Fallen Firefighters Foundation",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Human Services : Multipurpose Human Service Organizations",
        "url" : "http://www.firehero.org"
      }
    },
    "org11191" : {
      "-KeaVVASFvo11vwYjuXF" : {
        "-KeqakDYCw9G7hL85cYt" : {
          "MichaelHo" : "homeless_related"
        },
        "-KfIMPq9qxy3wz5uamC2" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "homeschoolfoundation.org",
        "id" : "org11191.htm",
        "mission_statement" : "Home School Foundation's mission is to bless homeschoolers and the cause of homeschooling. The Home School Foundation is the charitable arm of Home School Legal Defense Association. It was founded by HSLDA in 1994 with the original focus of helping other homeschool groups. God has since expanded our vision, however, to include needy families within the homeschool community. These two organizations are very closely tied in their mission to help and support the homeschool community. ",
        "name" : "Home School Foundation",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Community Development : Fundraising",
        "url" : "http://homeschoolfoundation.org"
      }
    },
    "org11403" : {
      "-KeaVW75TjkwDnoabheB" : {
        "-Keqao_2Zd1ASJx06nRP" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfISUp5rJ0Gxy4Fd4p3" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "legalaiddc.org",
        "id" : "org11403.htm",
        "mission_statement" : "The Legal Aid Society of the District of Columbia was formed in 1932 to provide civil legal aid to individuals, families and communities in the District who could not otherwise afford to hire a lawyer. Over the last 80 years, Legal Aid has helped tens of thousands of District residents obtain meaningful access to justice. Legal Aid is the law firm for clients who cannot afford a lawyer. Our staff and volunteers work each day in making the justice system work. Each year, with the support of the legal community, we extend our reach further and work harder to make justice meaningful for everyone. ",
        "name" : "Legal Aid Society of the District of Columbia",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.legalaiddc.org"
      }
    },
    "org11430" : {
      "-KeaVUzIfrmZz0nQqiXR" : {
        "-Keqb2Rma8GlwzsJ84FS" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfISbfPbjxM6eigYLzM" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "uwpv.org",
        "id" : "org11430.htm",
        "mission_statement" : "The United Way of Pioneer Valley mobilizes people and resources to strengthen our communities. We envision a thriving, caring region where individuals have opportunities to realize their human potential, are economically self-sufficient and contribute collectively to improve the quality of life in their communities. United Way targets its strategies at those critical passages in people's lives that determine what the future will hold for them as individuals and for their families and communities. This approach maximizes United Way's effectiveness, because it allows us to improve lives not just in the short term, and not just on the surface, but in a lasting and meaningful way that benefits the entire region. ",
        "name" : "United Way of Pioneer Valley",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.uwpv.org"
      }
    },
    "org11454" : {
      "-KeaVSp1WorM1Sk0i5cH" : {
        "-Keqb8V9q65yCWL8lUuH" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KfIShA6MQ0uHLcGs1js" : {
          "Ceren" : "homeless_related"
        },
        "domain" : "uwwc.org",
        "id" : "org11454.htm",
        "mission_statement" : "United Way of Williamson County brings together resources and people with passion and expertise to create innovative, positive and lasting change that improves lives. We are all interdependent and connected. It takes all of us to strengthen our community and prevent problems from happening in the first place. United Way's goal is to create long-lasting changes by addressing the underlying causes of these problems. Living United means being a part of the change. It takes everyone in the community working together to create a brighter future. ",
        "name" : "United Way of Williamson County",
        "rater" : "n,MichaelHo,Ceren",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.uwwc.org"
      }
    },
    "org11503" : {
      "-KeaVUe6Ygwj8GJ1o6Za" : {
        "-KeqbBe2N0PpnpUfA5QV" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "teenchallengetx.org",
        "id" : "org11503.htm",
        "mission_statement" : "Teen Challenge of Texas provides adults and families with an effective and comprehensive Christian faith-based solution to life-controlling drug and alcohol problems in order for them to become productive members of society. By applying Biblical principles, Teen Challenge endeavors to help people become mentally sound, emotionally balanced, socially adjusted, physically well, and spiritually alive. Teen Challenge came to Texas in 1968, with the opening of the San Antonio campus, then called the Westwood Center. Teen Challenge of Texas now operates five campuses in Texas in the San Antonio, Houston, and Dallas/Fort Worth areas. ",
        "name" : "Teen Challenge of Texas",
        "rater" : "n,MichaelHo",
        "type" : "Health : Treatment and Prevention Services",
        "url" : "http://teenchallengetx.org/"
      }
    },
    "org11621" : {
      "-KeaVVkgubgkfrn63uWe" : {
        "-KeqbFwI0ITRA4T7STF4" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "catholicdioceseofwichita.org",
        "id" : "org11621.htm",
        "mission_statement" : "Inspired by God's love, it is the mission of Catholic Charities, Inc. to alleviate poverty and build strong families living in the 25 counties of south central and southeast Kansas, served by the Diocese of Wichita.  We serve all in need, regardless of faith.  ",
        "name" : "Catholic Charities, Inc. - Diocese of Wichita ",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://catholicdioceseofwichita.org/catholic-charities"
      }
    },
    "org11635" : {
      "-KeaVWFosCDGZ5Q4ImF0" : {
        "-KeqbKYe8O-di_acOMor" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "neworleansopera.org",
        "id" : "org11635.htm",
        "mission_statement" : "The mission of the New Orleans Opera Association (NOOA) is to provide the finest possible operatic performances within its means to the New Orleans Metropolitan Area, the State of Louisiana, and the River and Gulf Regions. NOOA's goals are to plan, produce and present opera of the highest musical and artistic caliber to reach out to a broad public, educating them and developing in them a greater awareness of opera; to provide a statewide education program that includes live performance in the schools, a local student matinee of a mainstage operatic production, free public performances, and opera education lectures; to facilitate the attendance and comfort of individuals with physical and mental impairments; and to maintain the H. Lloyd Hawkins Scenic Studio as a local, national and international opera resource. ",
        "name" : "New Orleans Opera Association",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://www.neworleansopera.org"
      }
    },
    "org11912" : {
      "-KeaVVC3kuusAFnjRiaA" : {
        "-KeqbUjQE0ug7oLsTTeY" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "washingtoncash.org",
        "id" : "org11912.htm",
        "mission_statement" : "Washington Community Alliance for Self-Help (C.A.S.H.) provides the business training, supportive community, and capital to help enterprising individuals with limited financial resources gain self-sufficiency through small business ownership.Washington CASH was created in 1995 after our founder Peter Rose visited a Grameen Bank program in Bangladesh-a microfinance model that made small loans to groups of disadvantaged women. Since then we've adapted the Grameen model to the Puget Sound region and the business landscape in the United States, leading with business training and supporting with financial tools and resources tailored to client needs. We continue to adapt our approach over time to incorporate best practices and meet changing client needs. Our ultimate goal is to advance individual financial self-sufficiency and community economic development through small business growth. ",
        "name" : "Washington Community Alliance for Self-Help",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "http://www.washingtoncash.org"
      }
    },
    "org12029" : {
      "-KeaVVF37Q-j8EEJOE6e" : {
        "-KeqbYTw26yw5RUfB4A0" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rmhwinstonsalem.org",
        "id" : "org12029.htm",
        "mission_statement" : "The Ronald McDonald House of Winston-Salem provides a home away from home for families of children who are receiving medical care in our community's hospitals. The House and Family Room programs offer physical comforts, emotional support, education, and referral services designed to promote the well-being of the whole family. As one of four Ronald McDonald Houses in North Carolina and one of more than 288 worldwide, we are happy to open our doors to families of pediatric patients and invite them to stay with us. Our House offers 35 bedrooms for families, three living rooms, two playrooms, a playground and a kitchen with home cooked meals almost every day. Since opening in 1984, the Ronald McDonald House has been serving families to our capacity for each of our 26 years. ",
        "name" : "Ronald McDonald House of Winston-Salem",
        "rater" : "n,MichaelHo",
        "type" : "Health : Patient and Family Support",
        "url" : "http://www.rmhwinstonsalem.org"
      }
    },
    "org12098" : {
      "-KeaVVePvBr5ylumPWqq" : {
        "-KeqbbIQRA4SaQqJBMYs" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "100blackmen.org",
        "id" : "org12098.htm",
        "mission_statement" : "Founded in 1991, the mission of 100 Black Men of America, Inc. is to improve the quality of life within their communities and enhance educational and economic opportunities for all African Americans. 100 Black Men of America, Inc. seeks to serve as a beacon of leadership by utilizing their diverse talents to create environments where children are motivated to achieve, and to empower people to become self-sufficient shareholders in the economic and social fabric of the communities they serve. 100 Black Men of America, Inc. is committed to the intellectual development of youth and the economic empowerment of the African American community based on the following precepts: respect for family, spirituality, justice, and integrity. ",
        "name" : "100 Black Men of America, Inc.",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.100blackmen.org/"
      }
    },
    "org12128" : {
      "-KeaVWusss4Vz49Pg1mS" : {
        "-KeqbhMf8qYu4ZSYnR7y" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "keeparthappening.org",
        "id" : "org12128.htm",
        "mission_statement" : "Founded in 1963, the Arts and Education Council is unique in that it is the only privately funded arts fundraising organization whose geographic reach benefits the 16-county, bi-state St. Louis metropolitan region. The Arts and Education Council enriches the vibrancy of the St. Louis community by investing in arts organizations and growing the base of local arts supporters. Arts are among our community's greatest assets. Whether it's music, dance, theatre, film, literary or visual arts, the arts teach us, inspire us and make us smile. The Arts and Education Council is a dynamic collaboration of businesses, individuals, and community partners who work to raise funds and enhance the quality and variety of arts experiences. ",
        "name" : "Arts and Education Council",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.keeparthappening.org"
      }
    },
    "org12168" : {
      "-KeaVWrd7fdIlTJRD2Mq" : {
        "-Keqc0hBeGNuSyZsHE6q" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "seriousfunnetwork.org",
        "id" : "org12168.htm",
        "mission_statement" : "SeriousFun Children's Network is a growing global community of independently managed and financed camps and partnership programs that have come together with a common purpose - to provide life-changing experiences to children with serious illnesses and their families around the world. Since 1988, more than 384,700 children and their families have been served, including over 253,800 children from 50 countries. Today, SeriousFun Children's Network includes 28 initiatives worldwide, all reaching beyond illness to help children and their families discover joy, confidence and a new world of possibilities. SeriousFun Children's Network and each of its member camps are independent not-for-profit organizations dependent upon private funding and the generosity of others to serve all children free of charge.  ",
        "name" : "SeriousFun Children's Network",
        "rater" : "n,MichaelHo",
        "type" : "Health : Patient and Family Support",
        "url" : "http://www.seriousfunnetwork.org"
      }
    },
    "org12212" : {
      "-KeaVUliBjRddZ0gYg4S" : {
        "-Keqc3TQpNMJ-pyLO6Yn" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "womenoftomorrow.org",
        "id" : "org12212.htm",
        "mission_statement" : "Founded in 1997, the Women of Tomorrow Mentor & Scholarship Program (WOT) inspires, motivates and empowers young women to live up to their full potential through a unique mentoring program with highly accomplished professional women and scholarship opportunities. WOT is believed to be the only program of its kind in the country, pairing extremely accomplished professional women with small groups of at-risk teenage girls in public high schools for monthly mentoring sessions in a three to four year mentoring program. Women of Tomorrow currently operates in 43 Florida and 13 Metro Detroit cities serving over 2,500 at-risk young women annually in 130 public high schools with its network of over 350 highly accomplished professional women. Since the inception of its Scholarship Program in 2000, WOT has awarded over $3.2 million in scholarships to 1,186 WOT Mentees. ",
        "name" : "Women of Tomorrow Mentor & Scholarship Program",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.womenoftomorrow.org/"
      }
    },
    "org12410" : {
      "-KeaVVGYmLUR8CUpEieT" : {
        "-Keqc5gZvLf7zmrk2arX" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "lazarushouse.org",
        "id" : "org12410.htm",
        "mission_statement" : "Lazarus House Ministries is spiritually based and welcomes all in the name of God. We provide a continuum of care encompassing, but not limited to: shelter, food, clothing, advocacy, education, work preparation, health services, a listening ear, a welcoming heart, and the restoration of dignity and self-respect to people who are poor and in dire need. Although we are a faith-based ministry, we are not affiliated with any church. We serve to empower our guests to move beyond poverty and crisis and to become productive members of their community. ",
        "name" : "Lazarus House",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Homeless Services",
        "url" : "http://www.lazarushouse.org"
      }
    },
    "org12418" : {
      "-KeaVWvcKKhO0OkJI0Ws" : {
        "-Keqc7eRf25iDsB1jFIU" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "lawmo.org",
        "id" : "org12418.htm",
        "mission_statement" : "Legal Aid of Western Missouri (LAWMo) has been providing essential legal services to low-income citizens since 1964. LAWMo staff attorneys, paralegals and volunteers assist over 20,000 people each year with problems that seriously affect their ability to provide for themselves and their families. Priority is given to cases involving housing, employment, domestic abuse, immigration, consumer problems and public benefits. LAWMo clients are people who have nowhere else to turn, who without the legal assistance LAWMo can provide, would likely become homeless statistics or worse. LAWMo works to ensure there is equal access to justice for those without the ability to pay. ",
        "name" : "Legal Aid of Western Missouri",
        "rater" : "n,MichaelHo",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.lawmo.org"
      }
    },
    "org12420" : {
      "-KeaVW2eHMK1-LuUh05w" : {
        "-KeqcKNn7_F2BK2zL96s" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "accordiafoundation.org",
        "id" : "org12420.htm",
        "mission_statement" : "Accordia Global Health Foundation and our many partners are working to build a vibrant, healthy Africa where every individual can thrive. Overcoming the burden of infectious diseases in Africa by creating innovative health models, building centers of excellence, and strengthening medical institutions Our programs enhance local healthcare capacity to promote and deliver consistent quality of care, and strengthen academic medical institutions to train healthcare professionals and nurture young African researchers. We are dedicated to transferring knowledge and skills, and to building of infrastructure, that will lead to an Africa that can move forward independently toward a healthier future. ",
        "name" : "Accordia Global Health Foundation",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "http://www.accordiafoundation.org"
      }
    },
    "org12432" : {
      "-KeaVVOQRGYPSx268K4s" : {
        "-KeqcNsnU_x-ucmF2lsP" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "sierranevadaalliance.org",
        "id" : "org12432.htm",
        "mission_statement" : "Since 1993, the Sierra Nevada Alliance has been protecting and restoring Sierra lands, water, wildlife and communities. Their mission is to protect and restore the natural resources of the Sierra Nevada for future generations while promoting sustainable communities. The organization is an Alliance of conservation groups that are based or work in the Sierra Nevada region. There are over eighty-five Member Groups that span the entire 400 mile mountain range. The Sierra Nevada Alliance unites individuals and groups behind a common vision. The Alliance envisions a Sierra where natural and human communities coexist in harmony. A Sierra where residents and visitors alike understand and value the unique qualities of the range and protect the places they love. ",
        "name" : "Sierra Nevada Alliance",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Environmental Protection and Conservation",
        "url" : "http://www.sierranevadaalliance.org"
      }
    },
    "org12437" : {
      "-KeaVUprwxa0oKaXbJTi" : {
        "-KeqcSHQ6dzun5HvVHf0" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "gbls.org",
        "id" : "org12437.htm",
        "mission_statement" : "Greater Boston Legal Services' (GBLS) mission is to help poor families and individuals secure some of the most basic necessities of life that have illegally or inappropriately been denied. Clients include: families seeking benefits to avoid destitution; women and children seeking protection against abuse; homeless families seeking emergency shelter and permanent affordable housing; low-income tenants facing inappropriate eviction; elders and people with disabilities seeking inappropriately denied income support and medical benefits; and victims of torture seeking asylum in the U.S. In addition to representing individuals and families, GBLS engages in systemic advocacy to bring about positive change for the poor. GBLS also represents community groups and provides community legal education.  Advocates provide advice and represent people in court, before agencies, and before city councils and the state legislature. In 2010, GBLS provided legal assistance to more than 15,000 clients. ",
        "name" : "Greater Boston Legal Services",
        "rater" : "n,MichaelHo",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.gbls.org"
      }
    },
    "org12528" : {
      "-KeaVVmfGWmZf3dhIrNd" : {
        "-KeqcWMXuUX9b8yg1q3b" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "youthhaven.org",
        "id" : "org12528.htm",
        "mission_statement" : "Founded in 1968, Youth Haven is a non-denominational Christian outreach with a single purpose of meeting the needs of disadvantaged youth - free of charge. With campuses in Michigan and Arizona, they have designed year-round on-site programs, Kids' Klub after school activities, Caring Clowns hospital outreach, and follow-up efforts to show hurting kids that God loves them, people care about them, and there is hope for the future! ",
        "name" : "Youth Haven, Michigan",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.youthhaven.org"
      }
    },
    "org12537" : {
      "-KeaVV-bKmJHRPb1CPqn" : {
        "-KeqcYfY3_4w3RdLQy6a" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "webdc.alsa.org",
        "id" : "org12537.htm",
        "mission_statement" : "Established in 1985, The ALS Association is the only national non-profit organization fighting Lou Gehrig's Disease on every front. By leading the way in global research, providing assistance for people with ALS through a nationwide network of chapters, coordinating multidisciplinary care through certified clinical care centers, and fostering government partnerships, The Association builds hope and enhances quality of life while aggressively searching for new treatments and a cure. We are leading the fight to treat and cure ALS through global research and nationwide advocacy while also empowering people with Lou Gehrig's Disease and their families to live fuller lives by providing them with compassionate care and support. ",
        "name" : "The ALS Association - DC/MD/VA Chapter",
        "rater" : "n,MichaelHo",
        "type" : "Health : Diseases, Disorders, and Disciplines",
        "url" : "http://webdc.alsa.org/site/PageServer?pagename=DC_homepage"
      }
    },
    "org12591" : {
      "-KeaVWCBeFeVbMNyZaOu" : {
        "-Keqcb82UJbvmv7BwtaM" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "lifewithoutlimbs.org",
        "id" : "org12591.htm",
        "mission_statement" : "Life Without Limbs works to cross boundaries and break down barriers, to build bridges that bring people to the love and hope found in Jesus Christ. Life Without Limbs was founded by Nick Vujicic who was born without arms or legs but was given the strength by God to surmount countless challenges and obstacles. Life Without Limbs is all about sharing this same hope and genuine love that Nick has personally experienced with people all over the globe through the Life Without Limbs website and live speaking events. ",
        "name" : "Life Without Limbs",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Activities",
        "url" : "http://www.lifewithoutlimbs.org/"
      }
    },
    "org12755" : {
      "-KeaVUqbxnEL906rGZ_W" : {
        "-KeqcdmurUA3EG5cz9b5" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "concernfoundation.org",
        "id" : "org12755.htm",
        "mission_statement" : "Founded in 1968, Concern Foundation is a pioneer in funding Immunology Research worldwide. As a grassroots nonprofit based in Los Angeles, Concern Foundation is committed to funding cancer research scientists to further the advancements that are being made in conquering cancer. Concern also serve the local community of Los Angeles with multiple events a year to benefit children with cancer and their families. By hosting events at Universal Studios and Paramount Pictures, it is our goal to make sure kids with cancer have fun and create lasting memories with their families and restore a sense of normalcy while battling or having survived cancer. ",
        "name" : "Concern Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.concernfoundation.org"
      }
    },
    "org12873" : {
      "-KeaVSyFHDxNYmNW0ui7" : {
        "-KeqcgXPNhOqGx_PRXLu" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bvgh.org",
        "id" : "org12873.htm",
        "mission_statement" : "BIO Ventures for Global Health (BVGH) works to save lives by accelerating the development of novel drugs, vaccines, and diagnostics coming from the biotechnology industry that address the unmet medical needs of the developing world. We work at the crossroads of biotechnology and global health to find the common ground between the goals of the global health community and the pragmatic needs of companies. We engage companies to drive partnerships and invest in global health initiatives that result in the new drugs, vaccines, and diagnostics that will save lives in poor countries. ",
        "name" : "BIO Ventures for Global Health",
        "rater" : "n,MichaelHo",
        "type" : "Health : Medical Research",
        "url" : "http://www.bvgh.org"
      }
    },
    "org12925" : {
      "-KeaVSqTEPE45MfQacfh" : {
        "-KeqcmQngtb20a13CV05" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "alumni.umd.edu",
        "id" : "org12925.htm",
        "mission_statement" : "The University of Maryland Alumni Association supports and promotes the university in its pursuits of excellence in teaching, research and public service and to foster a spirit of loyalty, involvement and life-long commitment to the university by its alumni. ",
        "name" : "University of Maryland Alumni Association",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://alumni.umd.edu/s/1132/start.aspx"
      }
    },
    "org12956" : {
      "-KeaVSnvrCNK_mjWndz-" : {
        "-KeqdDl2iSipUCAg5443" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bgcphila.org",
        "id" : "org12956.htm",
        "mission_statement" : "The Boys & Girls Clubs of Philadelphia enable all young people, especially those who need us most, to reach their full potential as productive, caring, responsible citizens. The Boys & Girls Clubs of Philadelphia provide a safe place to learn and grow; ongoing relationships with caring, adult professionals; life-enhancing programs and character development experiences; and hope and opportunity for more than 13,000 Philadelphia youth each year. The Boys & Girls Clubs of Philadelphia has served our city's youth since 1887. Our Germantown, Wissahickon, and Nicetown units are three of the original Clubs that were part of the founding of the Boys & Girls Clubs of America more than 100 years ago. ",
        "name" : "Boys & Girls Clubs of Philadelphia",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.bgcphila.org"
      }
    },
    "org12980" : {
      "-KeaVUp7awluKM64fOQf" : {
        "-KeqdFK2iu5p5mmEbvwh" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "sojournercenter.org",
        "id" : "org12980.htm",
        "mission_statement" : "Since 1977, Sojourner Center has provided shelter and support services to tens of thousands of women and children affected by domestic violence. Through empowerment, families discover hope and have the opportunity to build new futures free from violence. As one of the nation's largest domestic violence shelters, Sojourner Center is a tireless advocate for domestic violence victims and survivors. With the continued support of the community, Sojourner Center can help women and children overcome the impact of domestic violence, one life at a time. ",
        "name" : "Sojourner Center",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.sojournercenter.org/"
      }
    },
    "org13049" : {
      "-KeaVWikYVvUj194-HgL" : {
        "-KeqdIGA5EbN9XKXfO9l" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "unitywalk.org",
        "id" : "org13049.htm",
        "mission_statement" : "The Parkinson's Unity Walk (PUW), a grassroots organization, began in 1994 through the dedicated efforts of patients, families, support groups, and friends who were affected by Parkinson's disease. Their main goal was to raise awareness and funds for research to find a cure for Parkinson's. Over the last eighteen years, the Unity Walk has grown from 200 participants in the first event to over to 10,000 participants in the 2012 Walk. The funds raised for the Walk have also dramatically increased with each passing year. In 1994, the Unity Walk raised $16,000 in research funds, and in 2012 over $1,800,000 was raised for Parkinson's research. Over $12,000,000 has been raised since the Walk's inception. ",
        "name" : "Parkinson's Unity Walk",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.unitywalk.org"
      }
    },
    "org13089" : {
      "-KeaVSrz8cxQh5VLF_u_" : {
        "-KeqdTav4kOOvATHg0yk" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "echovermont.org",
        "id" : "org13089.htm",
        "mission_statement" : "ECHO's mission is to educate and delight people about the Ecology, Culture, History and Opportunity for stewardship of the Lake Champlain Basin. ECHO Lake Aquarium and Science Center is a 28,500 square foot, award-winning LEED facility. Founded in 2003, ECHO welcomes more than 150,000 visitors annually with interactive exhibits and science education programs that include over 70 species of fish, amphibians, invertebrates, and reptiles; and more than 100 interactive experiences. ",
        "name" : "ECHO Lake Aquarium and Science Center",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://www.echovermont.org"
      }
    },
    "org13158" : {
      "-KeaVWXWiORogmrVvLmg" : {
        "-KeqdebQ2bTmKDoOIrP_" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "opendoorcommunityhouse.org",
        "id" : "org13158.htm",
        "mission_statement" : "In the spirit of Christian ministry, the mission of Open Door Community House is to work in partnership with other area service providers to meet basic needs and to empower low income individuals to realize their full potential as children of God. Open Door Community House offers opportunities for spiritual growth, establishes relationships with individuals and families in need, and works cooperatively with other area service agencies to bring about reconciliation in the lives of people in the community. Throughout its history, Open Door has expanded to meet the increasing needs of the community, which has responded by opening its heart to those in need. Open Door works with children, women and families to embody Christ and empower those who need help and hope. ",
        "name" : "Open Door Community House",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Children's and Family Services",
        "url" : "http://opendoorcommunityhouse.org/"
      }
    },
    "org13173" : {
      "-KeaVSfcDTXlRX3WAIU6" : {
        "-KeqeAP7_bOViTVJeWW6" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "touchfoundation.org",
        "id" : "org13173.htm",
        "mission_statement" : "Touch Foundation is working to improve the health of the Tanzanian population by increasing access to essential, quality healthcare for those who need it most. Touch improves access to care by focusing on two main activities: ? Increasing the quantity and quality of the healthcare workforce? Improving healthcare delivery mechanisms to enable provision of care by the health workers Touch Foundation was founded in 2004 by Lowell Bryan, a senior Director at McKinsey & Company (now Director Emeritus). Since inception, Touch has helped graduate 209 physicians (~10% of the country's physicians) and about 1,800 allied health care professionals, including assistant medical officers, nurses, lab technicians and radiographers. The vast majority of these graduates have remained in Tanzania, currently working in the Tanzanian healthcare sector. Over their careers, they will care for thousands of people and save many precious lives. ",
        "name" : "Touch Foundation",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "http://www.touchfoundation.org/"
      }
    },
    "org13187" : {
      "-KeaVVm-k7XiQNn6qA0o" : {
        "-KeqeFwTPzSBoD_KSPfP" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "bracusa.org",
        "id" : "org13187.htm",
        "mission_statement" : "BRAC is a development success story, spreading solutions born in Bangladesh to 10 other countries around the world - a global leader in creating opportunity for the world's poor. What started out as a limited relief operation in 1972 in a remote village of Bangladesh has turned into the largest development organization in the world. Organizing the poor using communities' own human and material resources, it catalyses lasting change, creating an ecosystem in which the poor have the chance to seize control of their own lives. We do this with a holistic development approach geared toward inclusion, using tools like microfinance, education, healthcare, legal services, community empowerment and more. Our work now touches the lives of an estimated 126 million people in 11 countries. BRAC USA is a US affiliate created in 2007 to advance and support BRAC's global mission. ",
        "name" : "BRAC USA",
        "rater" : "n,MichaelHo",
        "type" : "International : Foreign Charity Support Organizations",
        "url" : "http://www.bracusa.org"
      }
    },
    "org13219" : {
      "-KeaVV0WtwUhBO1O-Pyq" : {
        "-Keqg9NBfoqNVhan3j6l" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "petfinderfoundation.com",
        "id" : "org13219.htm",
        "mission_statement" : "The Petfinder Foundation, a nonprofit 501(c)3 public charity, helps shelters and rescue groups save homeless pets through adoptions, disaster response and recovery and becoming more sustainable. Its mission is to ensure that no adoptable pet is euthanized for lack of a home. The Foundation provides cash, training and equipment and supplies so that hundreds of thousands of homeless pets can have happier lives and the people who work with them can do their jobs better.  ",
        "name" : "Petfinder Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Animal Rights, Welfare, and Services",
        "url" : "http://www.petfinderfoundation.com/"
      }
    },
    "org13248" : {
      "-KeaVWltmb9b0IK7J62N" : {
        "-KeqgEuO60r1_iIFEgO3" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "rmhc-nwfl.org",
        "id" : "org13248.htm",
        "mission_statement" : "Since opening in 1984, Ronald McDonald House Charities of Northwest Florida has served as a home-away-from-home and source of respite and resources for more than 20,000 adults and children. Originally built as a 6-bedroom facility, we underwent 2 expansions before opening a brand new 26-bedroom House at 5200 Bayou Boulevard in Pensacola, Florida on August 23, 2010. This larger facility allowed us to serve 485 more families in the first year alone! ",
        "name" : "Ronald McDonald House Charities of Northwest Florida",
        "rater" : "n,MichaelHo",
        "type" : "Health : Patient and Family Support",
        "url" : "http://rmhc-nwfl.org/"
      }
    },
    "org13260" : {
      "-KeaVWJgj2nGs6hFug0B" : {
        "-KeqgNTcpjK99ZwTiIVm" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "marathonkids.org",
        "id" : "org13260.htm",
        "mission_statement" : "The mission of Marathon Kids is to improve the health of children by providing them the motivation, tools and support to live happier and healthier lifestyles. ",
        "name" : "Marathon Kids",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Children's and Family Services",
        "url" : "http://www.marathonkids.org/"
      }
    },
    "org13326" : {
      "-KeaVVj4gWeJ_DB8tYjR" : {
        "-KeqggSIFLMUhkBOMToe" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-KeqhRylWY8jEIMgu-3f" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "nepva.org",
        "id" : "org13326.htm",
        "mission_statement" : "In 1947, a small group of paralyzed veterans living in the local area formed the New England Chapter Paralyzed Veterans of America (NEPVA). NEPVA is a 501(c)(3) tax-exempt non-profit organization that represents the interests and concerns of paralyzed veterans and other individuals with disabilities throughout the New England area. The organization currently has over 1,000 members and continues to grow. The organization's primary focus is veterans' issues, notably quality healthcare for veterans with spinal cord injuries and dysfunction (SCI/D) such as Multiple Sclerosis (MS). NEPVA is interested in all issues affecting the lives of persons with disabilities. NEPVA routinely works with other community civic groups and agencies and has always been a strong advocate for accessibility to all aspects of life that are available to the general population. ",
        "name" : "New England Paralyzed Veterans of America",
        "rater" : "n,MichaelHo",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.nepva.org/"
      }
    },
    "org13367" : {
      "-KeaVWt8KJD0yCVnFNh2" : {
        "-Keqhc5eFiGdqLECw9U5" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "afscenter.org",
        "id" : "org13367.htm",
        "mission_statement" : "Founded in 1980, Alzheimer's Family Services Center (AFSC) provides care solutions for people in various stages of memory loss Monday through Friday. The facility offers therapeutic activities, health and care coordination, counseling, and socialization for participants, as well as much-needed caregiver support and education for families. AFSC's mission is to improve quality of life for families challenged by Alzheimer's disease or another dementia through services tailored to meet individual needs. The agency is affiliated with Hoag Neurosciences Institute and works closely with the Orange County Vital Brain Aging Program launched by Hoag to raise awareness and improve understanding about the benefits of early detection and proper Alzheimer's disease treatment. ",
        "name" : "Alzheimer's Family Services Center",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.AFSCenter.org/"
      }
    },
    "org13524" : {
      "-KeaVVIzFwEVZ7gjLkBW" : {
        "-Keqhh-udLXY0pqx9N42" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "azbigs.org",
        "id" : "org13524.htm",
        "mission_statement" : "Founded in 1971, Yavapai Big Brothers Big Sisters (YBBBS) mission is to enhance the lives of children through quality mentoring relationships. Many children grow up without the time, attention and direction they need from caring adults. Screened volunteers act as friends, mentors and role models to school-aged children who are predominately from single-parent homes. These relationships are supported by a professional staff. Mentoring is the single most effective way to positively impact the life of a child. Research tells us that compared to all other youth their age, boys and girls matched with a Big Brother Big Sister or Family Match are 40% less likely to get arrested. ",
        "name" : "Yavapai Big Brothers Big Sisters",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.azbigs.org/"
      }
    },
    "org13533" : {
      "-KeaVVgkgyFCKuIgYtKH" : {
        "-KeqhoSXT0Xje36BLRj0" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rmhde.org",
        "id" : "org13533.htm",
        "mission_statement" : "Founded in 1986, the Ronald McDonald House of Delaware provides a safe, affordable \"home away from home\" to families of seriously or chronically ill or injured children who are being treated at area hospitals and operates 3 Ronald McDonald Family Rooms within pediatric units of hospitals across Delaware. The House is a place where families can stay together and receive the kind of special care they need at such difficult times. Families find a bit of comfort and peace and a hot evening meal after a long day at the Hospital. The Ronald McDonald House of Delaware's mission is to support families in reaching the hope of tomorrow from the challenges of today. ",
        "name" : "Ronald McDonald House of Delaware",
        "rater" : "n,MichaelHo",
        "type" : "Health : Patient and Family Support",
        "url" : "http://www.rmhde.org/"
      }
    },
    "org13536" : {
      "-KeaVUnWXP7UFf9b10Yg" : {
        "-Keqhw-Xn70wmlKCehr5" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "gmfus.org",
        "id" : "org13536.htm",
        "mission_statement" : "The German Marshall Fund of the United States (GMF) strengthens transatlantic cooperation on regional, national, and global challenges and opportunities in the spirit of the Marshall Plan. GMF does this by supporting individuals and institutions working in the transatlantic sphere, by convening leaders and members of the policy and business communities, by contributing research and analysis on transatlantic topics, and by providing exchange opportunities to foster renewed commitment to the transatlantic relationship. In addition, GMF supports a number of initiatives to strengthen democracies. ",
        "name" : "German Marshall Fund of the US",
        "rater" : "n,MichaelHo",
        "type" : "International : International Peace, Security, and Affairs",
        "url" : "http://www.gmfus.org/"
      }
    },
    "org13624" : {
      "-KeaVWprBql6WmpGA891" : {
        "-KeqiUWdZUjs0qlIBUBG" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "obshina.com",
        "id" : "org13624.htm",
        "mission_statement" : "Founded in 1973, Friends of Refugees of Eastern Europe (FREE), Inc.'s mission is to promote Jewish pride, identity and continuity among New American families in the greater Chicagoland area, by providing educational, religious, cultural and social services in a caring non-judgmental environment. FREE's programming and services focuses on Jewish family life cycle events and holidays and festivals in the Jewish calendar year. The FREE Hebrew schools, Bar and Bas Mitzvah preparation classes and youth clubs are an integral part of our youth education program. Adult Judaic classes and counseling and Family Shabat Services helps New Americans become proud members of the Jewish community. Our popular Memorial Yizkor and Kaddish programs are important and meaningful avenues that link generations and bridge continents. The widely acclaimed Shalom Magazine, a Russian language publication of FREE, features quality journalism and enjoys avid global readership. ",
        "name" : "Friends of Refugees of Eastern Europe Inc.",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.obshina.com/"
      }
    },
    "org13720" : {
      "-KeaVWURDyh-1MS2_LqD" : {
        "-KeqiWGO4-u7zbMwdJun" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "wcaboise.org",
        "id" : "org13720.htm",
        "mission_statement" : "The Women's and Children's Alliance offers safety, healing and freedom from domestic abuse and sexual assault. For more than 20 years, the Women's and Children's Alliance (WCA) has been in the forefront of providing services to women, men and their children healing from domestic abuse and sexual assault. Since that time, the WCA's crisis program has evolved into one of the most vital, unduplicated, comprehensive programs in our community and region. The WCA is proud to be a community leader in providing these critically needed services. We've been an important community partner for more than 100 years and providing safe places for women to live has always been at the core of our mission. ",
        "name" : "Women's and Children's Alliance",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.wcaboise.org/"
      }
    },
    "org13783" : {
      "-KeaVWklcqJ8cLJkIcik" : {
        "-KeqiYXlwgQkbIkgy0sx" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "interactofwake.org",
        "id" : "org13783.htm",
        "mission_statement" : "InterAct provides safety, support, and awareness to victims and survivors of domestic violence and rape/sexual assault. InterAct also promotes violence-free relationships and communities through collaboration, public information, education, and advocacy. InterAct is the only confidential domestic violence prevention program serving Wake County's twelve municipalities. ",
        "name" : "InterAct",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://interactofwake.org/"
      }
    },
    "org13822" : {
      "-KeaVSiismTwbVeCDxvx" : {
        "-Keqidxu5mSL0-sKs1HU" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "grsymphony.org",
        "id" : "org13822.htm",
        "mission_statement" : "The Grand Rapids Symphony was officially organized in 1930 and is recognized as one of America's leading regional orchestras. Our vision is for the Grand Rapids Symphony to be a more integral and indispensable part of the West Michigan community. The institution has long been an important part of the community, with musical excellence, diverse programming, collaborative spirit, and a commitment to learning all adding to the quality of life we enjoy in West Michigan. The Grand Rapids Symphony presents more than 400 performances each year, touching the lives of some 170,000. Nearly half of those who benefit are students, senior citizens and people with disabilities reached through extensive education and community service programs. ",
        "name" : "Grand Rapids Symphony",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://www.grsymphony.org/"
      }
    },
    "org13885" : {
      "-KeaVWmjK3Xv58Ot1lpy" : {
        "-KeqigdXUxNTJ8tauebm" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "spreadthewordnevada.org",
        "id" : "org13885.htm",
        "mission_statement" : "Founded in 2001, Spread the Word Nevada is dedicated to advancing early childhood literacy by placing books into the hands and homes of children within Southern Nevada's at-risk, low income communities. Through community collaboration, mentorship and family partnership programs, Spread the Word Nevada fosters reading and language development opportunities ultimately leading to brighter academic and economic futures for these children. We are dedicated to changing the lives of our at-risk children, one book at a time. ",
        "name" : "Spread the Word Nevada",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://spreadthewordnevada.org/"
      }
    },
    "org13980" : {
      "-KeaVV7kMCvxKQ9tclpL" : {
        "-Keqij19pYMk3jZwb43X" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bringrecycling.org",
        "id" : "org13980.htm",
        "mission_statement" : "Bring Recycling helps people understand how the stuff we use shapes the planet we share. We provide conservation education in the schools and community; recycling information and services; expertise for businesses; and a resale outlet for used building materials. Since 1971, we've worked to change attitudes and behaviors regarding waste. Today, we focus on the urgent issues of wasteful consumption and climate change. ",
        "name" : "Bring Recycling",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Environmental Protection and Conservation",
        "url" : "http://www.bringrecycling.org"
      }
    },
    "org13990" : {
      "-KeaVVPRFir-O74HYyDO" : {
        "-KeqimcPSTxs7ANCONTN" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "conservationlands.org",
        "id" : "org13990.htm",
        "mission_statement" : "The mission of the Conservation Lands Foundation is to protect, restore and expand the National Conservation Lands through education, advocacy and partnerships.  ",
        "name" : "Conservation Lands Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Environmental Protection and Conservation",
        "url" : "http://conservationlands.org/"
      }
    },
    "org13997" : {
      "-KeaVV_6CKWC-DC-244q" : {
        "-KeqiqYe2jZc9YOqMl4F" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bbbsky.org",
        "id" : "org13997.htm",
        "mission_statement" : "The Big Brothers Big Sisters of Kentuckiana Mission is to provide children facing adversity with strong and enduring, professionally supported 1-to-1 relationships that change their lives for the better, forever. The Big Brothers Big Sisters Vision is successful mentoring relationships for all children who need and want them, contributing to brighter futures, better schools, and stronger communities for all. For more than 100 years, Big Brothers Big Sisters has operated under the belief that inherent in every child is the ability to succeed and thrive in life. As the nation's largest donor and volunteer supported mentoring network, Big Brothers Big Sisters makes meaningful, monitored matches between adult volunteers (Bigs) and children (Littles), ages 7 through 16, in communities across the country. We develop positive relationships that have a direct and lasting effect on the lives of young people. ",
        "name" : "Big Brothers Big Sisters of Kentuckiana",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.bbbsky.org/site/c.8hJPK0MBJjL2H/b.6431223/k.EE75/Home_Page.htm"
      }
    },
    "org14023" : {
      "-KeaVWF8GpsnT5vfjGsi" : {
        "-Keqj-Pl0XfFMB4B6777" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "ridgefieldlibrary.org",
        "id" : "org14023.htm",
        "mission_statement" : "The Ridgefield Library is a vital resource for the community- not only in what it has to offer in terms of resources and services, but also in terms of its warm, helpful staff. With over 1,100 daily visitors, The Ridgefield Library serves a large number of new and returning patrons. We are actively involved with the life of our community and seek to serve our patrons with excellence. The Library is an intellectual and cultural center for Ridgefield, offering a supportive, welcoming environment that encourages all to read, discover, question exchange ideas, and grow. ",
        "name" : "Ridgefield Library Association",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Libraries, Historical Societies and Landmark Preservation",
        "url" : "http://www.ridgefieldlibrary.org/"
      }
    },
    "org14064" : {
      "-KeaVUisRrAGxQzB6gvS" : {
        "-Keqj2X0l6KTiAT7ZYA_" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rce-international.org",
        "id" : "org14064.htm",
        "mission_statement" : "The purpose of Resourcing Christian Education International (RCE) is to serve Christian education ministries in their mission of providing exceptional educational opportunities with a Biblical foundation and Christian worldview. As we partner with and assist educational institutions that range from traditional primary and secondary education schools to Christian colleges, seminaries and adult education centers, our goal is to serve them and their staff so that they can excel in the ministries to which God has called them! ",
        "name" : "Resourcing Christian Education International",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Activities",
        "url" : "http://www.rce-international.org/"
      }
    },
    "org14237" : {
      "-KeaVVw0l2e-VY4rQwcb" : {
        "-Keqj9udj16ExNxjEj_J" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "herdzone.com",
        "id" : "org14237.htm",
        "mission_statement" : "The mission and responsibility of the Big Green Scholarship Foundation is to ensure that all 350 student- athletes have an opportunity to receive an education. In order to continue in this mission, we must meet our goal of covering the $5.5 million athletic scholarship cost. ",
        "name" : "Big Green Scholarship Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.herdzone.com/sports/big-green/"
      }
    },
    "org14291" : {
      "-KeaVWVJSxgsnvOIMjfL" : {
        "-KeqjDJe-HY0oSgJWlL0" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "abuseintervention.org",
        "id" : "org14291.htm",
        "mission_statement" : "Domestic Abuse Intervention Services (DAIS) believes that a world free from violence is possible. We work to make Dane County, WI, a safer, more just, more equitable place for people who have experienced domestic violence, their children, and the people who love them. Our mission is to empower those affected by domestic violence and advocate for social change through support, education and outreach. To make this happen, DAIS offers a wide array of crisis intervention and community education/prevention programs, including a 24-hour Help Line, programming for children from violent homes, legal advocacy, support groups, emergency safety planning, and the only domestic violence shelter for all of Dane County. ",
        "name" : "Domestic Abuse Intervention Services",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://abuseintervention.org/"
      }
    },
    "org14309" : {
      "-KeaVUUBEzgzApeuYQ6B" : {
        "-KeqjED0QJUdvNIb2Lvs" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "emergencyshelterfoxvalley.org",
        "id" : "org14309.htm",
        "mission_statement" : "Emergency Shelter of the Fox Valley's mission is to provide temporary shelter to homeless individuals and families in a safe environment, while providing guidance to those both homeless and at-risk that promotes independence. The Emergency Shelter of the Fox Valley maintains a low rate of repeat clients compared to other shelters. The Emergency Shelter of the Fox Valley's proactive prevention program is designed to help those who are on the verge of becoming homeless. ",
        "name" : "Emergency Shelter of the Fox Valley",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Homeless Services",
        "url" : "http://emergencyshelterfoxvalley.org/"
      }
    },
    "org14318" : {
      "-KeaVVHOYL5wWJv-edUb" : {
        "-KeqjNgXhts5hnpVvuLe" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "lucyburns.org",
        "id" : "org14318.htm",
        "mission_statement" : "Founded in 2006, the mission of the Lucy Burns Institute is to empower our audience to engage in democracy by delivering exceptionally high quality information. We believe it's our duty to ensure that interested, engaged citizens never lack access to good information. We're arming citizens with the ability to take on special interest jargon and partisan propaganda. We're making the truth about political and judicial matters accessible and empowering citizens to align their votes with their values. We're working to close the gap between what voters have and what voters want. ",
        "name" : "Lucy Burns Institute",
        "rater" : "n,MichaelHo",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.lucyburns.org/"
      }
    },
    "org14346" : {
      "-KeaVWQbDsDrpibu9BxA" : {
        "-KeqjUWQvr5ueLqoi3aS" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "deaeducationalfoundation.org",
        "id" : "org14346.htm",
        "mission_statement" : "Established in 2001, the DEA Educational Foundation supports the DEA Museum through fundraising, advocacy and educational outreach, exhibit sponsorship, and educational program development. The DEA Educational Foundation allows the Museum to develop and implement engaging state of the art exhibits, displays, interactive stations and educational outreach programs on the many facets of licit and illicit drug problems in this country. In addition to the traveling exhibits, the Foundation is very proud to fund the DEA Youth Dance Program (DEA YDP). The DEA YDP is a free afterschool alternative to drugs through the fun, healthy, and expressive art form of dance. ",
        "name" : "DEA Educational Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Health : Treatment and Prevention Services",
        "url" : "http://www.deaeducationalfoundation.org/"
      }
    },
    "org14368" : {
      "-KeaVWgNGaaOpmxTC9BG" : {
        "-Keqj_w9eliOuJixteI-" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "highhopestr.org",
        "id" : "org14368.htm",
        "mission_statement" : "The mission of High Hopes is to improve the lives of people with cognitive, physical, and emotional disabilities through the benefits of therapeutic horseback riding and other equine-assisted activities, while serving the therapeutic riding profession through training and education. We are a premier therapeutic riding center and international instructor training site, accredited by the Professional Association of Therapeutic Horsemanship International (PATH Intl.) since 1979. We have served people with physical, emotional and developmental disabilities for more than a quarter of a century. We offer year round programs in equine assisted activities, including therapeutic riding, carriage driving and equine learning program. We also offer experiential learning through outreach programs, an integrated summer camp program and a variety of volunteer opportunities. ",
        "name" : "High Hopes",
        "rater" : "n,MichaelHo",
        "type" : "Health : Patient and Family Support",
        "url" : "http://highhopestr.org/"
      }
    },
    "org14453" : {
      "-KeaVSjRepFQ4lWYQppY" : {
        "-KeqjdJOgCHfLsz4udTJ" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "mealsonwheelsofcontracosta.org",
        "id" : "org14453.htm",
        "mission_statement" : "Meals on Wheels of Contra Costa Inc. supports homebound elders to maintain their health and dignity, and to live independently in the comfort and security of their own homes. We serve homebound senior citizens who have one or more chronic health conditions that prevent their preparing nutritious daily meals for themselves. We bridge the widening gap between an ever increasing number of frail homebound elders in need of Meals on Wheels in our county, and insufficient government funding for these critical services. ",
        "name" : "Meals on Wheels of Contra Costa",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.mealsonwheelsofcontracosta.org/"
      }
    },
    "org14499" : {
      "-KeaVWLxUlJAypnFZIA_" : {
        "-Keqjfpto6z99hTk0Hy6" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "louisianapurchasecouncil.org",
        "id" : "org14499.htm",
        "mission_statement" : "The Louisiana Purchase Council's mission is to \"serve others by helping to instill values in young people and in other ways, to prepare them to make ethical choices during their lifetime in achieving their full potential. The Louisiana Purchase Council serves 20 parishes in Northeast and Central Louisiana. Parishes include: Allen, Avoyelles, Caldwell, Catahoula, Concordia, East Carroll, Franklin, Grant, Jackson, LaSalle, Lincoln, Madison, Morehouse, Ouachita, Rapides, Richland, Tensas, Union, West Carroll, and Winn. ",
        "name" : "Boy Scouts of America, Louisiana Purchase Council",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.louisianapurchasecouncil.org/"
      }
    },
    "org14531" : {
      "-KeaVWeqUXq6sLkqWV35" : {
        "-KeqjlD0tCOSVqzZ4s2-" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "lcunitedway.org",
        "id" : "org14531.htm",
        "mission_statement" : "As a catalyst for community change, the Livingston County United Way identifies our community's most critical needs, and mobilizes the resources required to meet those needs. The Livingston County United Way is recognized as a convener and collaborating partner with many non-profit, for-profit, governmental and faith-based organizations -- all working to address the most critical needs of Livingston County residents. ",
        "name" : "Livingston County United Way",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.lcunitedway.org/"
      }
    },
    "org14532" : {
      "-KeaVVozQniaBKJG_mox" : {
        "-KeqjrQ9QHC-OXLDOqa_" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "unitedwayhallcounty.org",
        "id" : "org14532.htm",
        "mission_statement" : "Founded in 1948, the mission of the United Way of Hall County is to unite people, organizations and resources to improve lives in Hall County. Our focus is on EDUCATION, INCOME and HEALTH, because these are the building blocks for a good quality of life. We recruit the people and organizations from all across the community who bring the passion, expertise and resources needed to get things done. We invite you to be a part of the change. You can give, you can advocate and you can volunteer. That's what it means to Live United. ",
        "name" : "United Way of Hall County",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.unitedwayhallcounty.org/"
      }
    },
    "org14552" : {
      "-KeaVUW7nyWG_BEULuNr" : {
        "-Keqk0QPgRuEdKdgeQh9" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "swchristiancare.org",
        "id" : "org14552.htm",
        "mission_statement" : "Southwest Christian Care works to glorify God as guardians of the sanctity and dignity of life by providing physical, emotional, and spiritual care to our patients and their families and offer hope based on faith in Jesus Christ as Lord of life and death. We serve people from all walks of life, without regard to economic status, race or religion. We provide place where our patients and their family members can find inner peace and be strengthened and supported. Whether we are serving a terminally ill patient in hospice, providing respite for a child with special needs or giving special love and attention to seniors, our goal is to offer the very best care possible in a nurturing and accepting environment. ",
        "name" : "Southwest Christian Care",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.swchristiancare.org/"
      }
    },
    "org14557" : {
      "-KeaVUYeHkLGLfFNcHlM" : {
        "-Keqk23P1VdCTaKyc-S3" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "ministrywithcommunity.org",
        "id" : "org14557.htm",
        "mission_statement" : "Ministry with Community works to improve lives by providing food, daytime shelter and other services to people in Kalamazoo struggling with homelessness, poverty, mental illness and other challenges. Ministry with Community was founded in 1978 by a small group of people led by Dorothy Markusse. The mission continues: to improve lives by providing food, daytime shelter, and other services to people in Kalamazoo struggling with homelessness, poverty, mental illness and other challenges. Through community cooperation, we provide these services in an atmosphere of dignity, hope and unconditional acceptance. ",
        "name" : "Ministry With Community",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Homeless Services",
        "url" : "http://www.ministrywithcommunity.org/"
      }
    },
    "org14597" : {
      "-KeaVVDc8d2Eppjz_g78" : {
        "-Keqk5wY3czWlAIG_ZQq" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "aspsf.org",
        "id" : "org14597.htm",
        "mission_statement" : "In recognition of the severe impoverishment of single-parent families in Arkansas, the Arkansas Single Parent Scholarship Fund (ASPSF) was established in 1990. Modeled on successful incentive scholarship funds in two northwest Arkansas counties, the goal of the ASPSF is to assist low-income single parents to complete their post-secondary education in preparation for skilled employment. Our strategy is to work at the county level to organize affiliate scholarship funds operated by local residents and provide on-site assistance with all phases of affiliate development. ",
        "name" : "Arkansas Single Parent Scholarship Fund Program",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.aspsf.org/"
      }
    },
    "org14637" : {
      "-KeaVWflWeL06Ma9J9O3" : {
        "-Keqk8cP-bHnyHmOhCH_" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "lancasterhistory.org",
        "id" : "org14637.htm",
        "mission_statement" : "LancasterHistory.org is a community-based organization established to educate the public on the history of Lancaster County and its place in the history of Pennsylvania and the United States, to advance the missions of regional historical organizations, and to promote the acquisition, preservation, and interpretation of resources representing the history of Lancaster County, Pennsylvania within the broader context of state and national history, including the life and legacy of America's fifteenth president, James Buchanan, and to preserve and maintain Wheatland, his home. ",
        "name" : "LancasterHistory.org",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Libraries, Historical Societies and Landmark Preservation",
        "url" : "http://lancasterhistory.org/"
      }
    },
    "org14720" : {
      "-KeaVSnGnGZUrGn03AoM" : {
        "-KeqkBW1Bex3CnW8K-Y5" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "tulsacenter.org",
        "id" : "org14720.htm",
        "mission_statement" : "The Center for Individuals With Physical Challenges in Tulsa, Oklahoma was established in 1959 to provide organized social, cultural and recreational opportunities for persons with physical disabilities. The Center provides a wide variety of services for persons with physical challenges in three major program areas: rehabilitation services, adaptive recreation and community reintegration, in addition to several support groups that meet at the Center's facility. ",
        "name" : "The Center for Individuals With Physical Challenges",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.tulsacenter.org/"
      }
    },
    "org14764" : {
      "-KeaVViOKQ5ry2JqGqLj" : {
        "-KeqkG6efRn6V9er486d" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "nationalskillscoalition.org",
        "id" : "org14764.htm",
        "mission_statement" : "National Skills Coalition is a broad-based coalition working toward a vision of an America that grows its economy by investing in its people so that every worker and every industry has the skills to compete and prosper. We engage in organizing, advocacy, and communications to advance state and federal policies that support these goals - policies that are based on the on-the-ground expertise of our members. National Skills Coalition organizes broad-based coalitions seeking to raise the skills of America's workers across a range of industries. We advocate for public policies that invest in what works, as informed by our members' real-world expertise. And we communicate these goals to an American public seeking a vision for a strong U.S. economy that allows everyone to be part of its success. ",
        "name" : "National Skills Coalition",
        "rater" : "n,MichaelHo",
        "type" : "Research and Public Policy : Social and Public Policy Research",
        "url" : "http://www.nationalskillscoalition.org/"
      }
    },
    "org14917" : {
      "-KeaVSe0TR7PUFruAaY8" : {
        "-KeqkRX13Hm1x6HK-11O" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "centralgeorgiacouncil.org",
        "id" : "org14917.htm",
        "mission_statement" : "The Boy Scouts of America, Central Georgia Council is one of the largest councils in Georgia geographically, serving 24 counties of middle Georgia. Over 5,600 youth are served each year in programs from first grade through high school. About 1,800 adult volunteers serve Scouting under the guidance of a volunteer board of directors and a relatively small professional staff of six. Through Scouting programs, students are taught honesty, importance of service to others and skills that help define one's personal value system. ",
        "name" : "Boy Scouts of America, Central Georgia Council",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.centralgeorgiacouncil.org/"
      }
    },
    "org14988" : {
      "-KeaVWKKa4Sjzo5PKDap" : {
        "-KeqkSyeu6yGruxO-MV9" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rockthevote.com",
        "id" : "org14988.htm",
        "mission_statement" : "Fusing pop culture, politics, and technology, Rock the Vote works to mobilize the millennial voting bloc and the youth vote, protect voting rights, and advocate for an electoral process and voting system that works for the 21st century electorate. For almost 25 years, Rock the Vote has pioneered ways to make voting easier by simplifying and demystifying voter registration and elections for young adults. ",
        "name" : "Rock the Vote",
        "rater" : "n,MichaelHo",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.rockthevote.com/"
      }
    },
    "org15025" : {
      "-KeaVSz6anl-3UUA28af" : {
        "-KeqkX4PpKyuKvwdz0Qk" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "mikvachallenge.org",
        "id" : "org15025.htm",
        "mission_statement" : "Mikva Challenge develops youth to be informed, empowered, and active citizens and community leaders. We do this by engaging youth in action civics, an authentic and transformative learning process built on youth voice and youth expertise. We help low-income Chicago youth become meaningful actors in politics and, by doing so, we honor the Mikvas' decades of inspiring young adults to embark on careers in public service and politics. Since 2000, Mikva Challenge has trained over 40,000 young people through our elections, activism and policymaking programs. Through the Mikva process, young people connect with peers, adults and political issues, strategize about how to win their issue or campaign and take action to become real political participants. ",
        "name" : "Mikva Challenge",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.mikvachallenge.org/"
      }
    },
    "org15034" : {
      "-KeaVV_kxkHA_F4KMt8G" : {
        "-KeqkeptLHPEjWBc6gvt" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "thefreeclinics.org",
        "id" : "org15034.htm",
        "mission_statement" : "Founded in 2001, The Free Clinics (TFC) enhances the healthcare system in Hendeson County, North Carolina, and neighboring communities to ensure the accessibility of quality healthcare for uninsured, low-income clients. TFC works with volunteers and partnering healthcare providers to provide healthcare, prevention, education, medication access, and case management services, including specialty referrals. TFC strives to provide services that are not duplicated, instead focusing our energies and resources on those areas where care is unavailable or access is very limited. ",
        "name" : "The Free Clinics",
        "rater" : "n,MichaelHo",
        "type" : "Health : Treatment and Prevention Services",
        "url" : "http://thefreeclinics.org/"
      }
    },
    "org15040" : {
      "-KeaVW1vmBw0J9V10fmh" : {
        "-KeqkiPW5hvhiTO7ahkg" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "cannonymca.org",
        "id" : "org15040.htm",
        "mission_statement" : "The Cannon Memorial YMCA strengthens the foundations of our community through well-being and fitness, camps, family time, swim, sports and play, and other activities for people of all ages, incomes and abilities. We help build a healthy spirit, mind and body for all with the core values of caring, honesty, respect and responsibility at the heart of everything we do. With a commitment to nurturing youth development, promoting healthy living, and fostering a sense of social responsibility, we ensure that every individual has access to the essentials needed to learn, grow and thrive. ",
        "name" : "Cannon Memorial YMCA",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Multipurpose Human Service Organizations",
        "url" : "http://www.cannonymca.org/"
      }
    },
    "org15057" : {
      "-KeaVSmbE0tT1FMNQnQ1" : {
        "-Keqkn0tKTS9rvJ7zeLB" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "ndi-nm.org",
        "id" : "org15057.htm",
        "mission_statement" : "NDI New Mexico was founded with the knowledge that the arts have a unique power to engage and motivate children. The purpose of our distinctive programs is to help children develop discipline, a standard of excellence, and a belief in themselves that will carry over into all aspects of their lives. Our work is guided by our belief in children, as well as our commitment to social responsibility, excellence, sustainability and financial integrity. ",
        "name" : "NDI New Mexico",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.ndi-nm.org"
      }
    },
    "org15069" : {
      "-KeaVUoMffA4V419h5lD" : {
        "-KeqksltAmDnl9Ujmh4Q" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "hfldetroit.org",
        "id" : "org15069.htm",
        "mission_statement" : "Founded in 1895, the Hebrew Free Loan of Metropolitan Detroit provides financial help to Jewish people in the state of Michigan through the lending of money without interest. We help people in accordance with the core Jewish values of respect, compassion and confidentiality. Hebrew Free Loan's biblical directive is to lend money without interest to help Jewish people have better lives. Our goal is to match that directive with the needs of the 21st century Metropolitan Detroit (and all of Michigan) Jewish Community. Today, we help first-generation Americans pay for college, couples afford an expensive adoption or fertility process, individuals who have recently been laid off to manage their bills, and the start of new business ventures. ",
        "name" : "Hebrew Free Loan of Metropolitan Detroit",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "https://www.hfldetroit.org/"
      }
    },
    "org15142" : {
      "-KeaVVh_ZTlRbhMa_Dfh" : {
        "-KeqkuueJrRONLFpNTBr" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "thebakken.org",
        "id" : "org15142.htm",
        "mission_statement" : "The Bakken Museum is a one-of-a-kind museum exploring the mysteries of our electrical world. Inspiring a passion for science and its potential for social good by helping people explore the history and nature of electricity and magnetism. It is a museum with electrifying exhibits and activities that are fun for kids and families and an education center that offers top quality hands-on programs for students and teachers. The Bakken has the world's leading collection of books and artifacts on the history of electricity in life. ",
        "name" : "The Bakken Museum",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://thebakken.org"
      }
    },
    "org15233" : {
      "-KeaVVth-C7Q4uJzAlY3" : {
        "-KeqkxadXjxJlaR8imli" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bostonbeyond.org",
        "id" : "org15233.htm",
        "mission_statement" : "Founded in 2005, Boston After School & Beyond is a public-private partnership that seeks to ensure that every child in Boston has the opportunity to develop to his or her full potential. Boston Beyond's role is to expand learning and skill development opportunities for students. Boston Beyond mobilizes partnerships among program providers, philanthropy, business and higher education, and the City of Boston, especially the Boston Public Schools. Boston Beyond advances student learning by leveraging the strengths of program providers, both large and small, through a coordinated approach to school and community partnerships. This coordinated approach is at the core of every Boston Beyond initiative. ",
        "name" : "Boston After School & Beyond",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://bostonbeyond.org/"
      }
    },
    "org15323" : {
      "-KeaVWL5Hqv_YlfaWRuu" : {
        "-Keql2zQjtnY6FM-UngK" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "dmplayhouse.com",
        "id" : "org15323.htm",
        "mission_statement" : "The Des Moines Community Playhouse partners with volunteers to create and deliver extraordinary theatre and education programs for communities in Central Iowa through high-quality entertainment with special emphasis on issues of social significance; programs which allow for the development of individual self-expression and self-esteem; and programs which identify and encourage individuals to pursue professional theatre development. ",
        "name" : "Des Moines Community Playhouse",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "https://www.dmplayhouse.com/"
      }
    },
    "org15374" : {
      "-KeaVUd0NCTRKXZaLOiX" : {
        "-Keql8HXKgRm0-oGT3nU" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "mocanomi.org",
        "id" : "org15374.htm",
        "mission_statement" : "Founded in 1981, the Museum of Contemporary Art (MOCA) is dedicated to making contemporary art accessible to diverse audiences - especially underserved populations - through the collection, preservation and exhibition of the best of contemporary art and its art historical influences. The Museum of Contemporary Art is known for its provocative and innovative exhibitions, and for seeking a fresh approach in examining the art of our time. The museum maintains an active exhibition schedule, presenting 8 to 10 exhibitions annually. ",
        "name" : "Museum of Contemporary Art North Miami",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://mocanomi.org/"
      }
    },
    "org15393" : {
      "-KeaVWbXft2EViGfKiTo" : {
        "-KeqlMD13BqFXBcQjT5K" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "caringplacetx.org",
        "id" : "org15393.htm",
        "mission_statement" : "Founded in 1986, The Caring Place is a local, faith-based organization that addresses the basic human needs of people within its service area, and collaborates with community partners to improve the quality of life of every client. Honoring its faith-based roots, The Caring Place serves its clients and communities by responding to the basic human needs of people in Georgetown and Northern Williamson County, providing access to resources that help clients to improve their quality of life, and engaging and empowering clients, volunteers, donors and staff to create a welcoming environment and a place with purpose. ",
        "name" : "The Caring Place",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.caringplacetx.org/"
      }
    },
    "org15542" : {
      "-KeaVSx6ku1yo6pG9dU7" : {
        "-KeqlOtYY6r48HtRMx7N" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bandgclub.org",
        "id" : "org15542.htm",
        "mission_statement" : "The Boys & Girls Club of Burlington has been serving the children and youth of Chittenden County since 1942. The Club was started as a place for boys who needed constructive alternatives to hanging out on Burlington street corners. As the years progressed, the Club evolved its membership to include girls as well as boys from very diverse racial, economic, ethnic and religious backgrounds. Today, the Club reaches children and youth through its many programs and constant outreach activities from two locations in the Old North End of Burlington.   The mission of the Boys and Girls Club of Burlington is to inspire and enable community youth, especially those who need us most, to realize their full potential as productive, healthy, responsible and caring citizens. ",
        "name" : "Boys & Girls Club of Burlington",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.bandgclub.org"
      }
    },
    "org3204" : {
      "-KeaVVEGRXaqJ-m94V3t" : {
        "-KeqlSY91bj3HAQM8wEK" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "amginternational.org",
        "id" : "org3204.htm",
        "mission_statement" : "Founded in 1942, AMG (Advancing the Ministries of the Gospel) International is an evangelical mission and relief agency, working in approximately 50 countries of the world. Our mission is clear: to give each person at least one opportunity to hear and respond to the gospel. At AMG, we endeavor to meet people at the point of their need whether it be hunger, sickness, or hopelessness, and show them Jesus as the only answer to the problems of this life and the only hope for eternal life. Our Christian missionary activities include children's work and relief, newspaper and magazine evangelism, radio and television evangelism, and missionary projects and support. ",
        "name" : "AMG International",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Activities",
        "url" : "http://www.amginternational.org"
      }
    },
    "org3389" : {
      "-KeaVUTDGCL3CzbzN4vl" : {
        "-KeqlVQXW2zm0LjiNAXJ" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "broadwaycares.org",
        "id" : "org3389.htm",
        "mission_statement" : "Broadway Cares/Equity Fights AIDS (BC/EFA) is one of the nation's leading industry-based, nonprofit AIDS fundraising and grant making organizations. By drawing upon the talents, resources, and generosity of the American theatre community, since 1988 BC/EFA has raised over $195 million for essential services for people with AIDS and other critical illnesses across the United States.   BC/EFA is the major supporter of seven programs at The Actors' Fund, including The HIV/AIDS Initiative, The Phyllis Newman Women's Health Initiative, The Al Hirschfeld Free Health Clinic and more.  BC/EFA also awards annual grants to more than 400 AIDS and family service organizations nationwide. ",
        "name" : "Broadway Cares/Equity Fights AIDS",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.broadwaycares.org"
      }
    },
    "org3392" : {
      "-KeaVT074JDPU202Jrme" : {
        "-KeqlaSIDYFlzef7yQTG" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bbg.org",
        "id" : "org3392.htm",
        "mission_statement" : "Growing from its humble beginnings as an ash dump in the late 1800s, Brooklyn Botanic Garden (BBG) has come to represent the very best in urban gardening and horticultural display. Its mission is to connect people to the world of plants, fostering delight and curiosity while inspiring an appreciation and sense of stewardship of the environment. In the Garden, in its community, and well beyond, BBG inspires people of all ages through the conservation, display, and enjoyment of plants; with educational programs that emphasize learning by doing; and with research focused on understanding and conserving regional plants and plant communities. ",
        "name" : "Brooklyn Botanic Garden",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Botanical Gardens, Parks, and Nature Centers",
        "url" : "http://www.bbg.org"
      }
    },
    "org3478" : {
      "-KeaVT-TlRXiI3GkETpG" : {
        "-KeqlfEQZ4enk_0LCdUR" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "childrenincorporated.org",
        "id" : "org3478.htm",
        "mission_statement" : "Founded in 1964, Children Incorporated (CI) is an international organization assisting children of all races and creeds, administering to their physical, emotional, and educational needs. It is the aim of CI to continue assisting and cooperating with other organizations and institutions throughout the world which are dedicated to the maintenance, support, education and welfare of needy children, and the maintenance and education of young adults seeking higher education, enabling them to become responsible citizens of the global community. CI assists approximately 20,000 children annually, in over 300 projects in 22 countries around the world. ",
        "name" : "Children Incorporated",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "https://www.childrenincorporated.org"
      }
    },
    "org3502" : {
      "-KeaVT0q7ZwiIc0JufBC" : {
        "-KeqliPH782vx5yjadZw" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "unbound.org",
        "id" : "org3502.htm",
        "mission_statement" : "Unbound's mission is to walk with the poor and marginalized of the world. ",
        "name" : "Unbound",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "http://www.unbound.org"
      }
    },
    "org3608" : {
      "-KeaVV9QQxdnBh_a8QmN" : {
        "-KeqlleI22lN4qBmy1ZY" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "botanicgardens.org",
        "id" : "org3608.htm",
        "mission_statement" : "Founded in 1951, the mission of Denver Botanic Gardens is to connect people with plants, especially plants from the Rocky Mountain region and similar regions around the world, providing delight and enlightenment to everyone Located in the middle of the Mile High City, Denver Botanic Gardens was one of the first gardens in the country to emphasize native plants and to champion environmentally responsible practices, such as water conservation and biological control of pests. Today, Denver Botanic Gardens continues this tradition at three unique sites: Denver Botanic Gardens, Denver Botanic Gardens at Chatfield and Mount Goliath. Each of these demonstrates the varied ecosystems of Colorado. ",
        "name" : "Denver Botanic Gardens",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Botanical Gardens, Parks, and Nature Centers",
        "url" : "http://www.botanicgardens.org"
      }
    },
    "org3634" : {
      "-KeaVSvAS8wn6tYeV1UJ" : {
        "-Keqlr3QWLitczVbDC9w" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "acttheatre.org",
        "id" : "org3634.htm",
        "mission_statement" : "A Contemporary Theatre (ACT) brings the best in contemporary theatre to Seattle's most discerning and daring audiences. It is what we do. Since 1965, ACT has probed cultural boundaries, tackled social issues and penetrated hearts. ACT made history as the first theatre in Seattle dedicated to producing contemporary plays, and we're still making history as the most welcoming development house for new plays around. With our multiple stages and diversity of work, ACT keeps you intimately involved with new theatre. From its original base of 300 subscribers, ACT has grown into a nationally recognized theatre serving nearly 8,000 subscribers. Since 1998, six of ACT's world premiere plays have gone on to New York as ACT productions. ",
        "name" : "A Contemporary Theatre",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://www.acttheatre.org"
      }
    },
    "org3676" : {
      "-KeaVVUuBJaA7c0vmbnW" : {
        "-KeqltzeNhzAKy_8hwEb" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "ecfs.org",
        "id" : "org3676.htm",
        "mission_statement" : "Ethical Culture Fieldston School (ECFS) was founded in 1878 by Felix Adler. His educational vision - to develop individuals who will be competent to change their environment to greater conformity with moral ideals - is as important today as it was when ECFS was founded. We continue to realize that vision by exploring what it means to be an ethical and responsible member of society, valuing inclusion and economic and racial diversity, striving for academic excellence, and teaching students to become independent thinkers through progressive education. ECFS provides educational instruction for approximately 1,670 students in various classes from pre-kindergarten through the twelfth grade. Our school challenges students to reach their highest potential in body, mind and spirit through the humanities, sciences, the arts and physical education. ",
        "name" : "Ethical Culture Fieldston School",
        "rater" : "n,MichaelHo",
        "type" : "Education : Private Elementary and Secondary Schools",
        "url" : "http://www.ecfs.org"
      }
    },
    "org3703" : {
      "-KeaVWONIqKc6Mc4JsVS" : {
        "-KeqlxVtkNoO0Q_Et_P3" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "youthranches.org",
        "id" : "org3703.htm",
        "mission_statement" : "Founded in 1957, the Florida Sheriffs Youth Ranches works to prevent juvenile delinquency and develop strong, lawful, resilient, and productive citizens who will make a positive contribution to our communities for years to come. The Florida Sheriffs Youth Ranches is a growing network of services providing a wide array of child-care programs for children living within the state of Florida. These services include residential care and camping services such as summer camp, Harmony in the Streets, community based services, clinical social services, family life education and Harmony in the Schools. ",
        "name" : "Florida Sheriffs Youth Ranches",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.youthranches.org"
      }
    },
    "org3773" : {
      "-KeaVVcQe8ZiSp7HazRo" : {
        "-Keqm-6mVDjBT4HaeYO7" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "cetconnect.org",
        "id" : "org3773.htm",
        "mission_statement" : "CET is a leading provider of education and enrichment in classrooms and living rooms throughout greater Cincinnati. Through PBS and local programming, innovative multimedia curriculum projects, parent workshops and teacher training, CET positively impacts millions of lives in our community. For more than 50 years, CET has been bringing greater Cincinnati television that stimulates the imagination, challenges the intellect, encourages achievement and celebrates diversity. CET's mission is to use its resources to educate, enrich and engage the communities it serves. ",
        "name" : "CET",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Public Broadcasting and Media",
        "url" : "http://www.cetconnect.org"
      }
    },
    "org3774" : {
      "-KeaVVCqodcoKrRmCZbY" : {
        "-Keqm31mqt3O8XWxmcuM" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "growyourgiving.org",
        "id" : "org3774.htm",
        "mission_statement" : "Incorporated in 1978, the Greater Kansas City Community Foundation works to improve the quality of life in Greater Kansas City by increasing charitable giving, educating and connecting donors to community needs they care about, and leading on critical community issues. The Community Foundation, including its six affiliates within the Greater Kansas City region, is recognized as a leading provider of charitable giving services.  ",
        "name" : "Greater Kansas City Community Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Community Foundations",
        "url" : "http://www.growyourgiving.org"
      }
    },
    "org4019" : {
      "-KeaVWPMLlO5p5xJQ_GB" : {
        "-Keqm80utIMbpOrunEpI" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "lafoodbank.org",
        "id" : "org4019.htm",
        "mission_statement" : "The Los Angeles Regional Food Bank has been serving the community since 1973. The Food Bank's mission is to mobilize resources to fight hunger in our community and our vision is that no one goes hungry in Los Angeles County. We are at the heart of a charitable food distribution network that includes 640 agencies with over 1,000 agency and program sites throughout Los Angeles County including abused and abandoned children homes, battered women shelters, senior centers, local food pantries, soup kitchens, AIDS hospices and more. In 2011, we distributed 60 million pounds of food including 14 million pounds of produce. We served 1 million men women and children. ",
        "name" : "Los Angeles Regional Food Bank",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Food Banks, Food Pantries, and Food Distribution",
        "url" : "http://www.lafoodbank.org"
      }
    },
    "org4135" : {
      "-KeaVWsP7BecXuBKAMsh" : {
        "-KeqmOcmvoU0ak4Poejt" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "lacma.org",
        "id" : "org4135.htm",
        "mission_statement" : "Los Angeles County Museum of Art (LACMA) was established in 1910 as part of the Los Angeles Museum of History, Science, and Art. LACMA's collections encompass the geographic world and virtually the entire history of art. Among the museum's special strengths are its holdings of Asian art, Latin American art, and Islamic art, of which LACMA hosts one of the most significant collections in the world. LACMA's mission is to serve the public through the collection, conservation, exhibition, and interpretation of significant works of art from a broad range of cultures and historical periods, and through the translation of these collections into meaningful educational, aesthetic, intellectual, and cultural experiences for the widest array of audiences. ",
        "name" : "Los Angeles County Museum of Art",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://www.lacma.org"
      }
    },
    "org4197" : {
      "-KeaVVuPpfXCAHu5eA7n" : {
        "-KeqmQw9CI-Q3y4TEq7e" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "preventblindness.org",
        "id" : "org4197.htm",
        "mission_statement" : "Founded in 1908, Prevent Blindness America is the nation's leading volunteer eye health and safety organization dedicated to fighting blindness and saving sight. Focused on promoting a continuum of vision care, Prevent Blindness America touches the lives of millions of people each year. Every year more than 120 million people read, hear or see our messages about early detection of eye disease and prevention of accidents that can cause permanent loss of sight. We train and certify adult and children's vision screeners and screening instructors through the only national program of its kind, providing 20,000 vision screening personnel with the skills they need to help people in their communities. ",
        "name" : "Prevent Blindness",
        "rater" : "n,MichaelHo",
        "type" : "Health : Diseases, Disorders, and Disciplines",
        "url" : "http://www.preventblindness.org"
      }
    },
    "org4279" : {
      "-KeaVWx3sXOtoClz-rdm" : {
        "-KeqmVP1BQAol81_tLL1" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "opb.org",
        "id" : "org4279.htm",
        "mission_statement" : "Founded in 1993, Oregon Public Broadcasting (OPB) provides free access to programming for children and adults. OPB is an independent public broadcaster of high quality and award winning radio and TV programs reaching more than 1.5 million people each week. Operating an extensive network of five television and eight radio stations, OPB is one of the largest producers and presenters of national television programming through PBS and is also a member station of National Public Radio and Public Radio International. OPB's mission is to give voice to the community, connect Oregon and its neighbors and illuminate a wider world. ",
        "name" : "Oregon Public Broadcasting",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Public Broadcasting and Media",
        "url" : "http://www.opb.org"
      }
    },
    "org4287" : {
      "-KeaVVr40g1MmtRSwzh7" : {
        "-Keqmhr2COkC3V1eTVKG" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "theoutreachfoundation.org",
        "id" : "org4287.htm",
        "mission_statement" : "The Outreach Foundation seeks to engage Presbyterians in Christ-centered evangelistic mission for the salvation of humankind. Through relationships with missionaries and projects with global partners, we help to create and sustain mission partnerships that build up the body of Christ for God's mission in the U.S. and around the world. We are a validated mission support group of the Presbyterian Church (USA), working in and beyond our denomination to help individuals and congregations participate in the amazing things that God is doing in the world. ",
        "name" : "The Outreach Foundation ",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Activities",
        "url" : "http://www.theoutreachfoundation.org/"
      }
    },
    "org4335" : {
      "-KeaVV8kyefNuQGa9qN-" : {
        "-KeqmkLf2nRuNXj6w1dW" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "pso.culturaldistrict.org",
        "id" : "org4335.htm",
        "mission_statement" : "For more than 100 years, the Pittsburgh Symphony Orchestra (PSO) has been an essential part of Pittsburgh's cultural landscape. The PSO prides itself in artistic excellence, a rich history of the world's finest conductors and musicians, a strong commitment to the Pittsburgh region, and the cultivation of its family of constituents and households. At home in historic Heinz Hall, the Pittsburgh Symphony Orchestra offers sought-after subscription concerts including 22 weeks of classical concerts annually, a Pops series of seven weekends, and the Fiddlesticks Family Concert series. The PSO also performs free, educational concerts in Heinz Hall for students, and summer concerts in Allegheny County parks. ",
        "name" : "Pittsburgh Symphony Orchestra",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://pso.culturaldistrict.org/pso_home"
      }
    },
    "org4337" : {
      "-KeaVWS4tk0GfOYljWoS" : {
        "-KeqmnAYmgIwKywdH6xT" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "planusa.org",
        "id" : "org4337.htm",
        "mission_statement" : "Plan International USA is part of a global organization that works side-by-side with communities in 50 developing countries to end the cycle of poverty for children.     Plan develops solutions community by community to ensure long-term sustainability. Our level of community engagement, long-term outlook and constant focus on the needs and priorities of children is unique among international development organizations. Our solutions are designed up-front to be owned by the community for generations to come and range from clean water and healthcare programs to education projects and child protection initiatives.   ",
        "name" : "Plan International USA",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "http://www.planusa.org/"
      }
    },
    "org4397" : {
      "-KeaVVLMgBe9oLHEkyB_" : {
        "-KeqmtlA0eW4tTj62huG" : {
          "MichaelHo" : "not_homeless_related"
        },
        "-Keqmv83on02LDUEJAb_" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rff.org",
        "id" : "org4397.htm",
        "mission_statement" : "Founded in 1952, Resources for the Future (RFF) improves environmental and natural resource policymaking worldwide through objective social science research of the highest caliber. RFF conducts independent research - rooted primarily in economics and other social sciences - on environmental, energy, and natural resource issues. RFF has pioneered the application of economics as a tool to develop more effective policy about the use and conservation of natural resources. Its scholars continue to analyze critical issues concerning pollution control, energy and transportation policy, land and water use, hazardous waste, climate change, biodiversity, ecosystem management, and the environmental challenges of developing countries. ",
        "name" : "Resources for the Future",
        "rater" : "n,MichaelHo",
        "type" : "Research and Public Policy : Social and Public Policy Research",
        "url" : "http://www.rff.org"
      }
    },
    "org4697" : {
      "-KeaVUrKcLrdh3bz4xsB" : {
        "-Keqmz8uuATM64YDIhSz" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "vistadelmar.org",
        "id" : "org4697.htm",
        "mission_statement" : "Vista Del Mar's mission is to provide comprehensive, family-centered social, educational and behavioral health services that encourage children, adolescents and their families to lead self reliant, stable and productive lives. Founded in 1908 Vista Del Mar placed orphaned children in an innovative cottage setting with house parents rather than the institutional environment typical of the time, Vista became known as one of the finest residential programs in the country. With the addition of its divisions: Reiss Davis Child Study Center, Julia Ann Singer Center, HomeSAFE and Family Service of Santa Monica, Vista is truly one of the most comprehensive care facilities for children experiencing mental health problems, behavioral problems, emotional problems, or social problems. ",
        "name" : "Vista Del Mar",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Children's and Family Services",
        "url" : "http://www.vistadelmar.org"
      }
    },
    "org4711" : {
      "-KeaVUmP0sAUibIxFwVz" : {
        "-Keqn2QvnGI7ueaWi3uI" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "washcoll.edu",
        "id" : "org4711.htm",
        "mission_statement" : "Washington College holds a significant place in the history of American higher education. Our heritage as the first college of the new nation - founded in 1782 under the patronage of our nation's first president - lives on today in our commitment to educating confident citizens and leaders capable of advancing the democratic and civic traditions of our Founding Fathers. With a student-to-faculty ratio of 12-to-1, Washington College is passionate about providing students a truly personalized education, one that tests and stretches the limits of students' talents and potential. ",
        "name" : "Washington College",
        "rater" : "n,MichaelHo",
        "type" : "Education : Private Liberal Arts Colleges",
        "url" : "http://www.washcoll.edu"
      }
    },
    "org4763" : {
      "-KeaVVVmAc7jc7CyTi3F" : {
        "-Keqn66uZWz1sQRiJYnB" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "worldmedicalrelief.org",
        "id" : "org4763.htm",
        "mission_statement" : "Established in 1953, World Medical Relief (WMR) is a multi-funded charitable organization whose mission is to impact the well-being of the medically impoverished on a local, national, and international basis. WMR achieves this through the collection of financial donations and goods, including medical, dental, and laboratory items, as well as through the purchase and distribution of such commodities. Goods are distributed in a non-discriminatory manner without regard to race, color, gender, religion, nationality or political beliefs. The Durable Medical Equipment provides low-income people with walkers, wheel chairs, commodes, and other medical equipment. Local Shipping provides tri-county area clinics with medical supplies and equipment, and the Medical Supply Program offers basic home health care supplies to individuals for a minimal charge. ",
        "name" : "World Medical Relief",
        "rater" : "n,MichaelHo",
        "type" : "International : Humanitarian Relief Supplies",
        "url" : "http://www.worldmedicalrelief.org"
      }
    },
    "org4875" : {
      "-KeaVVyA9RE7EUgk3Cmo" : {
        "-KeqnFFuUdrbiwGmoe1s" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "hria.org",
        "id" : "org4875.htm",
        "mission_statement" : "Founded in 1957 as The Medical Foundation, Health Resources in Action is a public health and medical research funding organization committed to helping people live healthier lives and creating healthy communities through prevention, health promotion and research. For nearly half a century The Medical Foundation has worked with academic medical research institutions, health organizations, community coalitions and neighborhood groups, state and local governments, the faith community, and youth serving organizations to create grant programs to support medical research as well as identify and address important health issues in innovative ways. ",
        "name" : "Health Resources in Action",
        "rater" : "n,MichaelHo",
        "type" : "Health : Treatment and Prevention Services",
        "url" : "http://hria.org/"
      }
    },
    "org4944" : {
      "-KeaVShYxSeHasSxtraf" : {
        "-KeqnH_9I8CEmJowm8B_" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "hearinghealthfoundation.org",
        "id" : "org4944.htm",
        "mission_statement" : "Hearing Health Foundation, formerly known as Deafness Research Foundation, is the leading national source of private funding for research in hearing and balance science. The mission of Hearing Health Foundation is to prevent and cure hearing loss and tinnitus through groundbreaking research. Since its founding in 1958, Hearing Health Foundation has awarded approximately 2,000 grants, totaling nearly $30 million. Hearing Health Foundation-funded research has led to dramatic innovations in hearing and balance science, such as: cochlear implants, universal newborn hearing screening, surgical therapy for otosclerosis, hair cell regeneration, and auditory research. Our new groundbreaking initiative, the Hearing Restoration Project (HRP), aims to find a cure for many types of hearing loss and tinnitus in the next decade. HRP is a 'dream team' of scientists who are working daily to find ways to regenerate hair cell growth in the human ear to restore hearing loss. ",
        "name" : "Hearing Health Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Health : Medical Research",
        "url" : "http://hearinghealthfoundation.org/"
      }
    },
    "org5087" : {
      "-KeaVUakG1psZQHAQSMf" : {
        "-KeqnMBQOTr3eO_DL6xG" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "teenchallengetc.com",
        "id" : "org5087.htm",
        "mission_statement" : "Teen Challenge Training Center has been offering faith-based, residential recovery services since 1958. Teen Challenge has faith-based recovery centers located in Pennsylvania, New York State and North Carolina. At Teen Challenge we teach principles with purpose. Through biblical principles we help our students define who they are and provide them with the tools needed to assist them in the process of recovery. A rigorous and regimented program Teen Challenge offers both personal growth and group studies and counseling. A variety of vocational training programs are available varying according to center location. ",
        "name" : "Teen Challenge Training Center",
        "rater" : "n,MichaelHo",
        "type" : "Health : Treatment and Prevention Services",
        "url" : "http://www.teenchallengetc.com/"
      }
    },
    "org5213" : {
      "-KeaVUk8XORr0rfKIASL" : {
        "-KeqnO0n24I-xiIy1igP" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "aquariumofpacific.org",
        "id" : "org5213.htm",
        "mission_statement" : "The Aquarium's mission is to instill a sense of wonder, respect and stewardship for the Pacific Ocean, its inhabitants and ecosystems, by involving the community, the region, and the nation in engaging, educational, and empowering exhibits and programs. Our vision is to create the first aquarium, and perhaps the first institution, in the world dedicated to conserving and building Natural Capital (Nature and Nature's services) by building Social Capital (the interactions between and among peoples). Opened in 1998 and located on the urban waterfront in Long Beach, California, the Aquarium of the Pacific hosts approximately 1.5 million visitors each year. The 156,000 square foot campus houses over 11,000 animal inhabitants of the Pacific Ocean, which provide the foundation for all Aquarium activities and serve as ambassadors for their animal counterparts in the wild. ",
        "name" : "Aquarium of the Pacific",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Zoos and Aquariums",
        "url" : "http://www.aquariumofpacific.org"
      }
    },
    "org5431" : {
      "-KeaVWDLI1DJD2Yy3Ktc" : {
        "-KeqnY61GJFaGsERyCHU" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "washingtoninstitute.org",
        "id" : "org5431.htm",
        "mission_statement" : "Founded in 1985, The Washington Institute for Near East Policy was established to advance a balanced and realistic understanding of American interests in the Middle East. The Institute seeks to bring scholarship to bear on the making of U.S. policy in this vital region of the world. Drawing on the research of its scholars and the experience of policy practitioners, the Institute promotes an American engagement in the Middle East committed to strengthening alliances, nurturing friendships, and promoting security, peace, prosperity, and democracy for the people of the region. To that end, the Institute's programming and research agenda is dedicated to what is and what ought to be on the minds of policymakers, diplomats, scholars, and journalists. ",
        "name" : "The Washington Institute for Near East Policy",
        "rater" : "n,MichaelHo",
        "type" : "International : International Peace, Security, and Affairs",
        "url" : "http://www.washingtoninstitute.org"
      }
    },
    "org5438" : {
      "-KeaVVz7KVCrPC4eHkki" : {
        "-Keqn_sHpMfHfBofTY1Y" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "inmed.org",
        "id" : "org5438.htm",
        "mission_statement" : "Since 1986, INMED Partnerships for Children has worked to rescue children from the immediate and irreversible harm of disease, hunger, abuse, neglect, violence and instability, and to prepare them to shape a brighter future for themselves and the next generation. Through a broad range of health, education, family support, youth development, agriculture and income generation programs, INMED creates opportunities that inspire hope, build self-reliance and encourage community collaboration, making each generation healthier, stronger, and more productive than the last. ",
        "name" : "INMED Partnerships for Children",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "http://www.inmed.org"
      }
    },
    "org5443" : {
      "-KeaVUVQW3v1z6Q7kk8y" : {
        "-KeqnbMH3DhoGC0DdP7O" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "nmac.org",
        "id" : "org5443.htm",
        "mission_statement" : "The National Minority AIDS Council develops leadership in communities of color to address the challenges of HIV/AIDS. Since 1987, NMAC has advanced its mission through a variety of public policy education programs; national conferences; treatment and research programs and trainings; electronic and printed resource materials; and a website: www.nmac.org. NMAC represents a coalition of 3,000 faith- and community-based organizations and AIDS service organizations delivering HIV/AIDS services in communities of color nationwide. ",
        "name" : "National Minority AIDS Council",
        "rater" : "n,MichaelHo",
        "type" : "Health : Diseases, Disorders, and Disciplines",
        "url" : "http://www.nmac.org"
      }
    },
    "org5841" : {
      "-KeaVWe9WI7Dr2B7S_No" : {
        "-KeqnjbP_PsNF9tILcVz" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "guidedogsofamerica.org",
        "id" : "org5841.htm",
        "mission_statement" : "Guide Dogs of America, founded in 1948 under the name International Guiding Eyes, is dedicated to providing guide dogs and instruction in their use, free of charge, to blind and visually impaired men and women from the United States and Canada so that they may continue to pursue their goals with increased mobility and independence. Guide Dogs of America has three main programs: the breeding program, the puppy raising program, and the guide dog program. We also provide advocacy services and follow-up free of charge for our graduates. A third service we provide is public education through our web site, tour and speaker programs, and by providing information upon request to help educate business or individuals about access laws and guide dogs. ",
        "name" : "Guide Dogs of America",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Animal Rights, Welfare, and Services",
        "url" : "http://www.guidedogsofamerica.org"
      }
    },
    "org5855" : {
      "-KeaVUvmvPpvy4yQYEpv" : {
        "-KeqnmYQ6wnXuixhWErg" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "casciencectr.org",
        "id" : "org5855.htm",
        "mission_statement" : "The California Science Center Foundation raises funds to support exhibits and education programs featured at the Science Center and manages exhibitions and programs of scientific, educational and industrial interest. The California Science Center aspires to stimulate curiosity and inspire science learning in everyone by creating fun, memorable experiences, because we value science as an indispensable tool for understanding our world, accessibility and inclusiveness, and enriching people's lives. The Center offers fun and informative permanent exhibits presented in interactive worlds. Through hands-on experiences in our galleries, you'll learn about human inventions and innovations, the life processes of living things and more. ",
        "name" : "California Science Center Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://www.casciencectr.org"
      }
    },
    "org5987" : {
      "-KeaVV19TprpvfF73W_9" : {
        "-Keqnppn7ggs2LwzxuAw" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "hsny.org",
        "id" : "org5987.htm",
        "mission_statement" : "Founded in 1900, incorporated in 1902, The Horticultural Society of New York (HSNY) enhances New York City's environmental and cultural life by providing unique educational, vocational and therapeutic outreach programs, library resources and exhibitions. HSNY has evolved into a multidisciplinary cultural and social service resource for the people of New York. HSNY is at the forefront of New York City's and the nation's growing focus on environmental concerns, green technology and urban agriculture; our interconnected programs promote the art and science of horticulture, and its vital role in contemporary life, to diverse communities across the five boroughs. ",
        "name" : "The Horticultural Society of New York",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Botanical Gardens, Parks, and Nature Centers",
        "url" : "http://www.hsny.org/"
      }
    },
    "org6002" : {
      "-KeaVUsFNa5JF4915n8B" : {
        "-KeqnsDA6uuqkBU_vP9z" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "learningleaders.org",
        "id" : "org6002.htm",
        "mission_statement" : "Founded in 1956 as the New York City School Volunteer Program, Learning Leaders was the first program of its kind in the country and served as a model for developing school volunteer programs in other major cities. Learning Leaders has grown to become the largest school volunteer and parent engagement program in the city and a valued partner of the New York City Department of Education. Learning Leaders has helped students succeed by providing individualized instructional support through the implementation of the Fundamental Program, essentially the one-on-one tutoring model. This program establishes volunteers to assist with reading, writing, ESL, math and other academic activities. Learning Leaders recruits, trains and supports up to 10,000 school volunteers who work with over 230,000 students. ",
        "name" : "Learning Leaders",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.learningleaders.org"
      }
    },
    "org6284" : {
      "-KeaVV5Y6W592zoADxKo" : {
        "-Keqo0TP62mO8ZW9HDcq" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "atlantaballet.com",
        "id" : "org6284.htm",
        "mission_statement" : "Founded in 1929, Atlanta Ballet is the longest continuously operating ballet company in the United States. Atlanta Ballet's eclectic repertoire spans ballet history, highlighted by beloved classics and inventive originals. Atlanta Ballet opened the Centre for Dance Education in 1996 and is dedicated to nurturing young dancers while providing an outlet for adults to express their creativity. With diverse class offerings and student population, the Centre serves over 150,000 people in metro Atlanta each year. Atlanta Ballet's roots remain firmly grounded in the Atlanta community and continue to play a vital role in the city's cultural growth and revitalization. ",
        "name" : "Atlanta Ballet",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://www.atlantaballet.com/"
      }
    },
    "org6411" : {
      "-KeaVVdHd00BPyV2JEQ0" : {
        "-Keqo3_gd8UOd_ne7akQ" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "forwardedge.org",
        "id" : "org6411.htm",
        "mission_statement" : "Forward Edge International is a missions and relief organization that addresses the urgent needs of afflicted people worldwide. By mobilizing hundreds of volunteers each year, Forward Edge alleviates suffering through disaster-response work, health-care projects and programs for at-risk children. Since 1983, more than 10,000 volunteers have served with Forward Edge in many parts of United States and 34 nations. ",
        "name" : "Forward Edge International",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Activities",
        "url" : "http://www.forwardedge.org"
      }
    },
    "org6414" : {
      "-KeaVW7jQlzFOYFSRxLS" : {
        "-Keqo4zIWYHCJ1PA--Ck" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "heartlandhumane.org",
        "id" : "org6414.htm",
        "mission_statement" : "Heartland Humane Society is a local animal welfare organization, founded in Benton County by a number of compassionate citizens in 1966. Our mission is to build a more compassionate community by teaching humane messages to our youth, caring for homeless animals and strengthening the human-animal bond. Our programs include running an open-door shelter where we care for more than 3,200 animals each year, visiting every local elementary school with programs that sow the seeds of compassion and teach responsible pet ownership as well as safety around animals, providing services for low-income pet guardians, behavior counseling and referrals, lost and found services, and many more programs. ",
        "name" : "Heartland Humane Society",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Animal Rights, Welfare, and Services",
        "url" : "http://www.heartlandhumane.org/"
      }
    },
    "org6493" : {
      "-KeaVWZxOPTBTlNSOpJE" : {
        "-Keqo7KuTaHDI2mqR8cf" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "shrinershospitalsforchildren.org",
        "id" : "org6493.htm",
        "mission_statement" : "Shriners Hospitals for Children is a one-of-a-kind international health care system of 22 hospitals dedicated to improving the lives of children by providing specialty pediatric care, innovative research and outstanding teaching programs. Children up to age 18 with orthopedic conditions, burns, spinal cord injuries, and cleft lip and palate are eligible for care and receive all services in a family-centered environment at no charge - regardless of financial need. ",
        "name" : "Shriners Hospitals for Children",
        "rater" : "n,MichaelHo",
        "type" : "Health : Treatment and Prevention Services",
        "url" : "http://www.shrinershospitalsforchildren.org/"
      }
    },
    "org6541" : {
      "-KeaVVrnyAG_jplqW5HH" : {
        "-Keqo9wmerV9mieBm4NB" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "hungernetwork.org",
        "id" : "org6541.htm",
        "mission_statement" : "The Hunger Network of Greater Cleveland is the largest direct emergency food distribution network in Cuyahoga County. We have 36 hunger centers which distribute a 3-5 day supply of food and 18 hot meal sites that prepare and serve an evening meal at the end of each month. We serve an average of 58,000 people each month. Half of those served are children. Our annual Walk for Hunger is a five kilometer walk-a-thon through downtown Cleveland which raises funds that provide meals during summer months. Throughout the summer children are at a great risk of going hungry every single day because they cannot use school lunches, often their only meal, as a resource for food. ",
        "name" : "Hunger Network of Greater Cleveland",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Food Banks, Food Pantries, and Food Distribution",
        "url" : "http://www.hungernetwork.org/"
      }
    },
    "org6544" : {
      "-KeaVWxiLzfE79-IIGJx" : {
        "-KeqohlIRC6_Pp3hmDCt" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "namonline.org",
        "id" : "org6544.htm",
        "mission_statement" : "The concept of Northwest Assistance Ministries (NAM) was presented as a community service project to the Northwest Clergy Association in April 1983. A little more than six months later, NAM began operations with a small Food Pantry, Assistance Program and Resale Shop. Today, NAM is a multi-program, community-based social services agency. NAM's mission is to strive to meet basic human needs through neighbors helping neighbors. Our goal is to serve in a spirit of humility and charity and to enable people toward independence while respecting racial, cultural, and religious differences. ",
        "name" : "Northwest Assistance Ministries",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.namonline.org/"
      }
    },
    "org6573" : {
      "-KeaVW4Bo7V9gCwcMm5Q" : {
        "-KeqojRfvaOo3l-fwjhi" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "lighthouseoakland.org",
        "id" : "org6573.htm",
        "mission_statement" : "Lighthouse of Oakland County (LOC) has been providing services to low-income families in Oakland County since 1972. Last year, LOC provided assistance to families and individuals in need on 70,000 separate occasions. The services these deserving people received were provided by LOC's three key subsidiaries: Lighthouse Community Development (LCD), rejuvenating communities through affordable housing and educated homeowners; Lighthouse Emergency Services (LES), providing emergency food, housing, medical, utility and other services to people who need immediate help; and Lighthouse PATH (PATH), which provides long-term housing and support to help women achieve self-sufficiency and a healthy family environment for their children. ",
        "name" : "Lighthouse of Oakland County",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.lighthouseoakland.org/Joomla/"
      }
    },
    "org6598" : {
      "-KeaVWNaM56NPoQKc__P" : {
        "-KeqopdetHQaoBp8VyCe" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "aavs.org",
        "id" : "org6598.htm",
        "mission_statement" : "Founded in 1883, the American Anti-Vivisection Society (AAVS) is the oldest non-profit animal advocacy and educational organization in the United States dedicated to ending experimentation on animals in research, testing, and education. AAVS also opposes and works to end other forms of cruelty to animals. We work with students, grassroots groups, individuals, teachers, the media, other national organizations, government officials, members of the scientific community, and advocates in other countries to legally and effectively end the use of animals in science through education, advocacy, and the development of alternative methods to animal use. ",
        "name" : "American Anti-Vivisection Society",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Animal Rights, Welfare, and Services",
        "url" : "http://www.aavs.org"
      }
    },
    "org6625" : {
      "-KeaVVo8adWKPnczVBDG" : {
        "-KeqosmHuEUqRM0aZwxz" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "projectfind.org",
        "id" : "org6625.htm",
        "mission_statement" : "Founded in 1969, Project FIND is dedicated to helping older adults on Manhattan's West Side to live more vital and independent lives in the community. Many of the men and women who live in our three supportive housing residences or come to our five senior centers are healthy and active, but may need greater access to social and recreational activities. Others may need a little more help. For the healthy and active seniors, the homeless, and the significant number of frail, poor, elderly people we serve, Project FIND is a true lifeline, providing housing, meals, and a broad array of activities that help older adults cope with the challenges of aging by encouraging healthy living, socialization, hope and optimism. ",
        "name" : "Project FIND",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.projectfind.org/"
      }
    },
    "org6632" : {
      "-KeaVWECcLz7iGKePtFV" : {
        "-KeqovnH_5ggxUtuB01z" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "greenamericatoday.org",
        "id" : "org6632.htm",
        "mission_statement" : "Founded in 1982, Green America's mission is to harness economic power-- the strength of consumers, investors, businesses, and the marketplace-- to create a socially just and environmentally sustainable society. We work for a world where all people have enough, where all communities are healthy and safe, and where the bounty of the Earth is preserved for all the generations to come. Green America is leading the way toward a more just and sustainable society. Together we have directed over $100 million in purchases to socially and environmentally responsible businesses that are the core of the living economy and channeled over $500 million in investments to community development financial institutions, including banks, credit unions, and loan funds. ",
        "name" : "Green America",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "http://www.greenamericatoday.org"
      }
    },
    "org6792" : {
      "-KeaVSl0YztFAPSfGUUA" : {
        "-KeqpLMZk1zIwNMBzSIC" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "eany.org",
        "id" : "org6792.htm",
        "mission_statement" : "Founded in 1969, Environmental Advocates of New York's mission is to protect our air, land, water and wildlife and the health of all New Yorkers. Based in Albany, we monitor state government, evaluate proposed laws, and champion policies and practices that will ensure the responsible stewardship of our shared environment. We work to support and strengthen the efforts of New York's environmental community and to make our state a national leader. We are the New York State affiliate of the National Wildlife Federation (NWF) and confer regularly with colleagues in across the country through our membership in the State Environmental Leadership Conference. ",
        "name" : "Environmental Advocates of New York",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Environmental Protection and Conservation",
        "url" : "http://www.eany.org/"
      }
    },
    "org7025" : {
      "-KeaVSsk3CZtvqZAbiQ-" : {
        "-KeqpSBYJqMQ7CbeHXvC" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "channel-one.org",
        "id" : "org7025.htm",
        "mission_statement" : "Channel One Regional Food Bank helps feed people in need through an efficient system of collection and distribution of food and non-food items to non-profit organizations that serve low-income people. Channel One Regional Food Bank takes in millions of pounds of surplus food from the food industry. That food is then distributed through our network of member agencies, including food shelves, soup kitchens, group homes and shelters. This past year, the Channel One obtained 4.8 million pounds of food and distributed 4.6 million pounds through the hunger relief network that serves a 14 county service area in Southeast Minnesota and Western Wisconsin. Channel One is certified member of Feeding America, The Nation's Food Bank Network. ",
        "name" : "Channel One Regional Food Bank",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Food Banks, Food Pantries, and Food Distribution",
        "url" : "http://www.channel-one.org/"
      }
    },
    "org7029" : {
      "-KeaVSlr3-KxkMfF9-N7" : {
        "-KeqpUax7uLqLZH0Xzu2" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "mnenvirofund.org",
        "id" : "org7029.htm",
        "mission_statement" : "Twenty-one members strong, the Minnesota Environmental Fund is a balanced group of organizations with one common goal: maintaining our high-quality environment. Minnesota Environmental Fund provides education and a vital payroll giving choice to employees through our member organizations that protect, conserve and restore Minnesota's environment. Minnesota Environmental Fund provides the opportunity for employees to choose the environmental cause(s) they wish to support: protecting the air, water, land, and food; advocating environmental justice; or promoting a safe, clean and healthy environment throughout Minnesota. ",
        "name" : "Minnesota Environmental Fund",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.mnenvirofund.org/"
      }
    },
    "org7033" : {
      "-KeaVSkOyY-idSmsur-g" : {
        "-KeqpY_B0wsEbbCulh33" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "operationbootstrapafrica.org",
        "id" : "org7033.htm",
        "mission_statement" : "Operation Bootstrap Africa (OBA) is a Minnesota-based, inter-denominational organization dedicated to helping people help themselves in a variety of educational programs in Africa. OBA began its mission of service in Tanzania in the mid-1960's, and was incorporated in 1965. OBA seeks to assist with educational opportunity in Africa, and has funded more than 2,250 classrooms and teachers' quarters in Tanzania alone. In that same timeframe the literacy rate of Tanzania has gone from 10% to 85%. In recent years, OBA has expanded into Madagascar, Zimbabwe and The Gambia, always working on self-help partnership agreements, in response to requests for assistance. ",
        "name" : "Operation Bootstrap Africa",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "http://www.operationbootstrapafrica.org/"
      }
    },
    "org7047" : {
      "-KeaVVB8q5OoZsAMyg3o" : {
        "-Keqpdgwf6stDHDQ9q7w" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "trumanlibrary.org",
        "id" : "org7047.htm",
        "mission_statement" : "The Harry S. Truman Library Institute is the nonprofit partner of the Harry S. Truman Library. The Truman Library is one of twelve presidential libraries operated by the Federal government. Since 1957, the Truman Library and the Truman Library Institute have worked together to fulfill the Truman Library's commitment to research and education The Library Institute was organized to foster and assist in the Truman Library's growth and development as a national center for study and research. The purposes of the Institute are to promote research into the Truman administration through the awarding of grants and the sponsoring of scholarly conferences, to assist in the development of the Library's museum and public programs, and to help the Library maintain the integrity of its programs. ",
        "name" : "Harry S. Truman Library Institute",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Libraries, Historical Societies and Landmark Preservation",
        "url" : "http://www.trumanlibrary.org/institute/"
      }
    },
    "org7221" : {
      "-KeaVSpp6MghHgdsu68n" : {
        "-Keqps0Qjf5Ln63HZT38" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "southernscholarship.org",
        "id" : "org7221.htm",
        "mission_statement" : "Incorporated in 1955, the Southern Scholarship Foundation works to help deserving young people who lack financial resources, but demonstrate excellent academic merit and moral character, attend institutions of higher education. Today the Foundation owns and/or operates a total of 25 scholarship houses; thirteen at Florida State University, three at Florida A&M; University in Tallahassee, eight at the University of Florida in Gainesville, and one at Florida Gulf Coast University in Ft. Myers. We are currently housing 400 students and have assisted more than 8,000 students since our inception. ",
        "name" : "Southern Scholarship Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.southernscholarship.org/"
      }
    },
    "org7222" : {
      "-KeaVWnSOlMR-1umvotP" : {
        "-Keqpw1IzaeGlSSse_mu" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bgccf.org",
        "id" : "org7222.htm",
        "mission_statement" : "Since 1944, Boys & Girls Clubs of Central Florida has helped inspire hope and opportunity in those who need it most - at-risk children in our local community. We provide safe places to learn and grow for nearly 13,000 children between the ages of 6 and 18 every year. At each of our 30 Clubs in Brevard, Orange, Osceola and Seminole counties, core youth development programs are offered to meet the diverse needs and interests of our members. ",
        "name" : "Boys & Girls Clubs of Central Florida",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.bgccf.org/"
      }
    },
    "org7282" : {
      "-KeaVW9MdaYpcCrJLVZl" : {
        "-Ker2yZpSIjMAdKEEZ42" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "ihradio.com",
        "id" : "org7282.htm",
        "mission_statement" : "Immaculate Heart Radio is a lay apostolate dedicated to spreading the knowledge, love and practice of the Roman Catholic Faith by means of radio. Our programming content is therefore primarily catechetical, devotional, and inspirational.Immaculate Heart Radio exists in response to the call of the Second Vatican Council to the laity to evangelize, and to its call for all members of the Church to use radio to evangelize. Immaculate Heart Radio offers its work in the worldwide effort to fulfill the call of Pope John Paul II for a New Evangelization and a New Springtime for the Church.Immaculate Heart Radio declares an absolute faithfulness to the Holy Father and the Bishops in union with him. We are bound to accurately and fully transmit the Faith as proposed by the Teaching Authority of the Church. We are specifically bound by the vehicle in which it is proposed for our time, the Catechism of the Catholic Church. We hold everything we broadcast up to the Catechism as its standard. These qualities shape our service to the faithful in the several dioceses in which we broadcast, our obedience to the bishops of those dioceses, and our assistance to local priests and religious.Immaculate Heart Radio is committed to Sharing the Heart of the Christian Faith in humility, charity, respect and ecumenism; and to draw upon the vast diversity of riches which is the Catholic heritage in order to broadcast something for every believer. ",
        "name" : "Immaculate Heart Radio",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Media and Broadcasting",
        "url" : "http://www.ihradio.com"
      }
    },
    "org7523" : {
      "-KeaVV3-IcAZR8Mmk8h8" : {
        "-Ker30093hois1PWP6vi" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "flynncenter.org",
        "id" : "org7523.htm",
        "mission_statement" : "The mission of the Flynn Center for the Performing Arts is to foster the enjoyment, understanding, and development of the performing arts in Vermont and the region. The Center is a full-service home for the performing arts in the region; offers a wide range of cultural and educational experiences to our community; and nurtures the creative development of new national and local performing artists. Events presented by the Flynn are carefully selected from among the finest performers and performances in the world; our educational programs connect audiences with the performing arts through a wide range of activities. The Flynn provides a well-equipped and managed home for the arts and services that include a box office, ushers (Flynn Spirits), concessions, and professional crew. ",
        "name" : "Flynn Center for the Performing Arts",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://www.flynncenter.org"
      }
    },
    "org7574" : {
      "-KeaVVIEmd9usuTKaZ0e" : {
        "-Ker33H1cn9tUPeG0TLO" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "catholiccharitiesok.org",
        "id" : "org7574.htm",
        "mission_statement" : "Since inception in 1912, Catholic Charities of the Archdiocese of Oklahoma City has served as a stabilizing force in the community, providing critical and necessary services to those in need. Catholic Charities works to provide help and hope to all through the Catholic tradition of service. As the social service outreach of the Catholic Church, dedicated volunteers and staff work within the following programs: Homeless Services for women and children, Family H.O.P.E. case management, Immigration Legal Services, Disaster Relief, Refugee Resettlement, Adoption and Pregnancy Services, advocacy, individual, family and marital counseling, suicide prevention training, Parish Outreach and Education, and Faith Community Health Ministry. ",
        "name" : "Catholic Charities of the Archdiocese of Oklahoma City",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.catholiccharitiesok.org/"
      }
    },
    "org7691" : {
      "-KeaVVM6MV-U92m_Y3Rh" : {
        "-Ker358ufbnbsMHMZ5iV" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rosies.org",
        "id" : "org7691.htm",
        "mission_statement" : "Since 1974 poor and homeless women have found an oasis of hope and nourishment at Rosie's Place. The mission of Rosie's Place is to help women maintain their dignity, seek opportunity and find security in their lives. With the help of people who believe change is possible and share our vision of justice, Rosie's Place has accomplished amazing things, both big and small. Each year: 74,000 nutritionally balanced meals are served in our warm and cheery dining room; 800 women choose free non-perishable food items and fresh produce from our groceries program each month; more than 500 women find safety and nurturing in our emergency and short-term housing; and advocates help more than 100 women find a home of their own and avoid eviction. ",
        "name" : "Rosie's Place",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Homeless Services",
        "url" : "http://www.rosies.org/"
      }
    },
    "org7738" : {
      "-KeaVW1FR9t7YoiqWqCi" : {
        "-Ker3G1GPIOlMbYfYKST" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "misshalls.org",
        "id" : "org7738.htm",
        "mission_statement" : "Established in 1898, Miss Hall's School combines a traditional college-preparatory curriculum with two innovative, nationally acclaimed programs: Horizons, a weekly off-campus, experiential learning opportunity, and the Girls' Leadership Project, which transforms the School into a leadership laboratory.Approximately 206 boarding and day students in grades nine through twelve come from 19 states and 22 countries. The student body is diverse with 25 percent of the students being of color and 33 percent being international. Approximately 50 percent of the students receive some level of financial assistance to attend the School. Miss Hall's School inspires and encourages each girl to pursue the highest standards of learning and character; to contribute boldly and creatively to the common good; and to seek a purposeful life based on honor, respect, and personal authenticity. ",
        "name" : "Miss Hall's School",
        "rater" : "n,MichaelHo",
        "type" : "Education : Private Elementary and Secondary Schools",
        "url" : "http://www.misshalls.org"
      }
    },
    "org7770" : {
      "-KeaVSgjoyTCeKrEbIZY" : {
        "-Ker3ID8vLEW78gAmMpA" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "jerusalemfellowships.org",
        "id" : "org7770.htm",
        "mission_statement" : "Jerusalem Fellowships strives to ignite Jewish pride on college campuses by educating students about the power and beauty of their Jewish heritage. We endeavor to achieve this goal by reaching out to college students by offering them low-cost tours and study trips to Israel and establishing campus outreach centers and programs throughout North America. In addition, Jerusalem Fellowships has set up the Hasbara Fellowships which educate and train university students to be effective pro-Israel activists on their campuses. Jerusalem Fellowships is an offshoot of Aish HaTorah, an apolitical, international network of Jewish educational centers providing opportunities for Jews to discover the wisdom and beauty of their heritage in an atmosphere of open inquiry and mutual respect. ",
        "name" : "Jerusalem Fellowships",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Activities",
        "url" : "http://jerusalemfellowships.org/"
      }
    },
    "org7785" : {
      "-KeaVWdKSPZ6yNimXIUB" : {
        "-Ker3O98IRJRKwHkdpgT" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "wamc.org",
        "id" : "org7785.htm",
        "mission_statement" : "WAMC/Northeast Public Radio is a regional public radio network serving parts of seven northeastern states. During the past year, WAMC provided public radio programming each month to over 300,000 residents of New York, Massachusetts, Connecticut, Vermont, New Jersey, New Hampshire and Pennsylvania. This programming includes news and cultural programming 24 hours a day, every day of the year. WAMC operates nine non-commercial educational FM radio stations, many FM translator stations, and several websites that distribute audio and visual materials. WAMC also distributes several programs produced at the organization's Albany studio to public radio stations across the nation and internationally. ",
        "name" : "WAMC/Northeast Public Radio",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Public Broadcasting and Media",
        "url" : "http://www.wamc.org/"
      }
    },
    "org7821" : {
      "-KeaVWVxEkAQ1VkyetX_" : {
        "-Ker3S7dxsvh3Sgp_2CG" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "omsfoundation.org",
        "id" : "org7821.htm",
        "mission_statement" : "Incorporated in 1959, the Oral and Maxillofacial Surgery Foundation is dedicated to advancing the long term development, health and well-being of the specialty and the public it serves through financial support of research and education consistent with the goals of the American Association of Oral and Maxillofacial Surgeons. Research and education are critical to making advances in the specialty. The Foundation's yearly funding of research awards and fellowships allows the specialty to develop new areas of scientific study which will affect the treatment of patients now and for years into the future. ",
        "name" : "Oral and Maxillofacial Surgery Foundation",
        "rater" : "n,MichaelHo",
        "type" : "Health : Medical Research",
        "url" : "http://www.omsfoundation.org/"
      }
    },
    "org7951" : {
      "-KeaVVv8RwzPNLqHN8I3" : {
        "-Ker3WkOFSLNsGcMCSj8" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rpa.org",
        "id" : "org7951.htm",
        "mission_statement" : "Founded in 1922, Regional Plan Association (RPA) is an independent regional planning organization that improves the quality of life and the economic competitiveness of the 31-county New York-New Jersey-Connecticut region through research, planning, and advocacy. For more than 80 years, RPA has been shaping transportation systems, protecting open spaces, and promoting better community design for the region's continued growth. We anticipate the challenges the region will face in the years to come, and we mobilize the region's civic, business, and government sectors to take action. RPA's current work is focused in five project areas: community design, open space, transportation, workforce and the economy, and housing. ",
        "name" : "Regional Plan Association",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "http://www.rpa.org/"
      }
    },
    "org7993" : {
      "-KeaVUx_MVgnljYUiH_6" : {
        "-Ker3YZ0bWqOxQjZgf8U" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "wildsalmoncenter.org",
        "id" : "org7993.htm",
        "mission_statement" : "The Wild Salmon Center is an international science-based organization whose mission is to identify, understand and protect the best wild salmon ecosystems of the North Pacific. We are committed to conserving for future generations the productivity, abundance, and biological diversity of wild salmon runs, and the healthy freshwater and coastal systems that sustain them. We envision a future where people throughout the North Pacific work together as stewards to sustain wild salmon and the immense benefits they provide people, rivers, and their watersheds. ",
        "name" : "Wild Salmon Center",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Wildlife Conservation",
        "url" : "http://www.wildsalmoncenter.org/"
      }
    },
    "org8016" : {
      "-KeaVV4cEzjHwedFfIwI" : {
        "-Ker3au07sAdwqBeQGFf" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "sos-usa.org",
        "id" : "org8016.htm",
        "mission_statement" : "SOS Children's Villages-USA was established to support SOS Villages worldwide. Since its founding, SOS Children's Villages International has expanded to almost 500 villages in 132 countries. We are currently raising over 73,000 children in our villages and through our many education, family strengthening, medical, and outreach programs, we impact the lives of over 1 million people each year. We work for children who are orphaned, abandoned or whose families are unable to care for them. We give these children the opportunity to build lasting relationships within an SOS family. We enable children to live according to their own culture and religion, and to be active members of the community. ",
        "name" : "SOS Children's Villages-USA",
        "rater" : "n,MichaelHo",
        "type" : "International : Development and Relief Services",
        "url" : "http://sos-usa.org"
      }
    },
    "org8020" : {
      "-KeaVV73eWmBClX7YQMw" : {
        "-Ker3cQdHCXb7vNIk6Bl" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "flholocaustmuseum.org",
        "id" : "org8020.htm",
        "mission_statement" : "Opened in 1992, the Florida Holocaust Museum honors the memory of millions of innocent men, women, and children who suffered or died in the Holocaust. The Museum is dedicated to teaching members of all races and cultures to recognize the inherent worth and dignity of human life in order to prevent future genocides. The Museum houses the premier permanent exhibit, History, Heritage and Hope, a compelling history of individuals of strength, courage and spirit, who confronted the extremes of hatred and persecution in their homes and communities. The Museum's education department creates stimulating educational programs that engage learners through using highly developed materials on the Holocaust, human rights, and genocide studies. ",
        "name" : "Florida Holocaust Museum",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Museums",
        "url" : "http://www.flholocaustmuseum.org/"
      }
    },
    "org8039" : {
      "-KeaVW-YuNMV-5OpBuwY" : {
        "-Ker3ee9L_9B0LHYJt9W" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "kaufman-center.org",
        "id" : "org8039.htm",
        "mission_statement" : "The Kaufman Music Center has roots dating back to 1952 when the Lucy Moses School was founded. The Kaufman Music Center brings together music education and performance for students and audiences of all ages, backgrounds, and skill levels, combining the finest music education for children and adults with boldly innovative yet intimate concert experiences spanning a wide range of music. All three of the Kaufman Music Center's divisions - Merkin Concert Hall, Lucy Moses School and Special Music School - are housed in the Goodman House on West 67th Street in Manhattan. Today, more than 75,000 music and arts lovers use the Goodman House annually. ",
        "name" : "Kaufman Music Center",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.kaufman-center.org"
      }
    },
    "org8127" : {
      "-KeaVV3jMrHYQsbk_cP2" : {
        "-Ker4z1Hwy1Kgo6v5hDJ" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "stanns.org",
        "id" : "org8127.htm",
        "mission_statement" : "Chartered by President Abraham Lincoln on March 3, 1863, St. Ann's Center for children, youth and families (formerly St. Ann's Infant & Maternity Home) has continued to care for needy women and children in the Washington metropolitan area, adapting our programs and services to respond to the needs of the day. St. Ann's has served as an orphanage, an adoption agency, an emergency shelter for abused children, a training ground for teenage mothers and an affordable day care program for working families. St. Ann's provides help, love and support for more than 450 women and children through our children's residential, teen mother-baby, community day care and Faith House programs. ",
        "name" : "St. Ann's Center for Children, Youth and Families",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Children's and Family Services",
        "url" : "http://www.stanns.org/"
      }
    },
    "org8187" : {
      "-KeaVW8gt22BhcEOyWbF" : {
        "-Ker50Qu5KDRgZ3IFCZq" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "greateryellowstone.org",
        "id" : "org8187.htm",
        "mission_statement" : "The Greater Yellowstone Coalition (GYC) was founded in 1983 to protect the lands, waters, and wildlife of the Greater Yellowstone Ecosystem. We emerged as a nationally known advocate for the idea that ecosystem level sustainability and science should guide the management of the region's public and private lands. This vast ecosystem includes twenty million acres of wild country that includes Yellowstone and Grand Teton national parks, parts of six national forests, three national wildlife refuges, and state and private lands in Wyoming, Idaho, and Montana. We work to protect the land from mining, oil and gas, and other such human developments; to ensure rare and imperiled wildlife are sustained, including grizzly bears, bison, wolves and cutthroat trout; and in the face of climate change, to implement adaptation strategies to give wildlife the best chance of survival in an uncertain future, such as by restoring degraded habitats and protecting climate sensitive habitats and species. ",
        "name" : "Greater Yellowstone Coalition",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Environmental Protection and Conservation",
        "url" : "http://www.greateryellowstone.org/"
      }
    },
    "org8240" : {
      "-KeaVW3Yh_nCCrKP6VWZ" : {
        "-Ker53mPOfzpYY_8i9Rl" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "orangehabitat.org",
        "id" : "org8240.htm",
        "mission_statement" : "Habitat for Humanity of Orange County, North Carolina changes lives by bringing together God's people and resources to help families in need build and own quality affordable homes. Since our start in 1984, Habitat, Orange County, has built 200 homes. Habitat for Humanity offers homeownership to Orange County families who otherwise may not have the opportunity to own a home of their own. Families pay $1,000 in closing costs and invest 325 hours of labor into building their own homes and the homes of others. With the security of a decent, safe home, Habitat families are able to turn their attention to improving other areas of their lives such as seeking more education, job training, and better employment. ",
        "name" : "Habitat for Humanity of Orange County, North Carolina",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "http://www.orangehabitat.org"
      }
    },
    "org8245" : {
      "-KeaVVN6rKrozuWEs8nr" : {
        "-Ker5I8eEWaRlWqX09oX" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "pps.org",
        "id" : "org8245.htm",
        "mission_statement" : "Project for Public Spaces (PPS) is dedicated to helping people create and sustain public spaces that build stronger communities. Founded in 1975, PPS embraces the insights of William (Holly) Whyte, a pioneer in understanding the way people use public spaces. Today, PPS has become an internationally recognized center for best-practices, information, and resources about placemaking. Since our founding we have worked in more than 2,000 communities in 26 countries around the world, helping people turn their public spaces into vital community places, with programs, uses, and people-friendly settings that build local value and serve community needs. ",
        "name" : "Project for Public Spaces",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Botanical Gardens, Parks, and Nature Centers",
        "url" : "http://www.pps.org"
      }
    },
    "org8274" : {
      "-KeaVVsTIjIBgfDW9UiB" : {
        "-Ker5LNeytKOhiNxOo9A" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "citizensnyc.org",
        "id" : "org8274.htm",
        "mission_statement" : "Our mission is simple: to help New Yorkers -especially those in low-income areas- come together and improve the quality of life in their neighborhoods. Residents are uniquely situated to define and act on the issues affecting their communities. When provided with modest support, neighborhood and school groups can effectively mobilize community resources to improve quality of life.Committee for New York City supports these grassroots efforts by offering grants, skills-building workshops and further technical support in the form of project planning assistance and an equipment share library.In 2014, we provided 366 projects with $1.6 million in grants and services, and our staff facilitated 30 workshops to over 500 social entrepreneurs. Since 1975, we have promoted the spirit of volunteerism, local engagement and social justice that drives our work. ",
        "name" : "Citizens Committee for New York City",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "http://www.citizensnyc.org"
      }
    },
    "org8286" : {
      "-KeaVWIWg5OWpmn_GI8z" : {
        "-Ker5U-umrcybCvz6qEE" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "pollinator.org",
        "id" : "org8286.htm",
        "mission_statement" : "The Pollinator Partnership is the largest organization working to protect the health of managed and native pollinating animals vital to our North American ecosystems and agriculture. The Pollinator Partnership (P2) website is a premiere source of information for consumers, gardeners, land managers, educators, resource managers, producers, and farmers to help pollinators, essential components for all of life. As one of its many projects, P2 manages the North American Pollinator Protection Campaign, a collaborative group of over 120 organizations and individuals that promote and implement a continent-wide action plan to encourage activities to protect the numbers and health of all pollinating animals. ",
        "name" : "Pollinator Partnership",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Wildlife Conservation",
        "url" : "http://pollinator.org/"
      }
    },
    "org8354" : {
      "-KeaVWRJTqWw4Q8TiP06" : {
        "-Ker5WVPfZjsIXO-zIFK" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "pottershouseschool.org",
        "id" : "org8354.htm",
        "mission_statement" : "In 1981, The Potter's House was started by a group of Calvin College graduates who decided they wanted to make a difference in their community. Seeing a need for education, they formed The Potter's House, a truly Christ-centered school. The Potter's House offers an excellent academic program in an urban environment. Rooted in Biblical principles and values, The Potter's House encourages students to reach their full potential by maintaining a healthy spiritual, physical, social, and emotional life. The Potter's House challenges students and their families to grow in their personal relationship with Jesus Christ. The Potter's House promotes unity and reconciliation in the Roosevelt Park Community. ",
        "name" : "The Potter's House",
        "rater" : "n,MichaelHo",
        "type" : "Education : Private Elementary and Secondary Schools",
        "url" : "http://www.pottershouseschool.org"
      }
    },
    "org8375" : {
      "-KeaVVNniunLveJmzeBX" : {
        "-Ker5Y1PlGGDOTL2dCaZ" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "parishschool.org",
        "id" : "org8375.htm",
        "mission_statement" : "Established in 1983, The Parish School's (TPS) mission is to identify, educate, and empower children who have language and learning differences. The Parish School specializes in early language intervention and individualized instruction with a focus on the education of the whole child. The Parish School is the only school in Houston, public or private, which offers a multi-age, language-based, developmental curriculum for children 18 months through fifth grade. Children served have communication and learning differences, but average to above average learning potential. TPS utilizes a classroom based therapy program implemented by certified teachers and speech/language pathologists. Classroom ratios are low and treatment/education plans are individualized to maximize the success of each child. ",
        "name" : "The Parish School",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.parishschool.org"
      }
    },
    "org8390" : {
      "-KeaVUbpMNX07rI9dovr" : {
        "-Ker5ZYHfl70qzm0p03c" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "pflag.org",
        "id" : "org8390.htm",
        "mission_statement" : "Founded in 1972, PFLAG (Parents, Families and Friends of Lesbians and Gays) promotes the health and well-being of gay, lesbian, bisexual and transgender persons, their families and friends through: support, to cope with an adverse society; education, to enlighten an ill-informed public; and advocacy, to end discrimination and to secure equal civil rights. PFLAG provides opportunity for dialogue about sexual orientation and gender identity, and acts to create a society that is healthy and respectful of human diversity. ",
        "name" : "PFLAG",
        "rater" : "n,MichaelHo",
        "type" : "Human and Civil Rights : Advocacy and Education",
        "url" : "http://www.pflag.org/"
      }
    },
    "org8472" : {
      "-KeaVWWr_1ItCi2Oiz47" : {
        "-Ker5c3e07Cw5yJY7s-3" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "coa-yfc.org",
        "id" : "org8472.htm",
        "mission_statement" : "COA Youth & Family Centers (Children's Outing Association) was founded in 1906 as a fresh air camp for needy immigrant children of Milwaukee. Today, the agency provides camping and year round programs including early education, after school and summer activities, adult education, and family and parenting programs. COA also offers a quality childcare program that is licensed by the State of Wisconsin for 120 children, ages six weeks through 12 years; and the Samson Family Center, which offers parent support groups, parenting classes and workshops. ",
        "name" : "COA Youth & Family Centers",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Children's and Family Services",
        "url" : "http://www.coa-yfc.org/"
      }
    },
    "org8561" : {
      "-KeaVWjSi9BRHccbYmvf" : {
        "-KetnhFXQVmhzcBzrSky" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "bigsnyc.org",
        "id" : "org8561.htm",
        "mission_statement" : "As the nation's oldest and NYC's largest mentoring agency, BBBS of NYC is acclaimed for our high standards and effective delivery of life changing programs. Since 1904, we have provided safe and impactful mentoring experiences to the youth who need them most. We continually evaluate and improve our services to best support our mission to provide children facing adversity in New York City with strong and enduring, professionally supported one-to-one mentoring relationships with adults that change their lives for the better, forever.  We partner with families, volunteers, organizations, and the community to inspire positive change in all. It is through this multi-level engagement that our programs have powerful community impact.  ",
        "name" : "Big Brothers Big Sisters of New York City",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://bigsnyc.org"
      }
    },
    "org8588" : {
      "-KeaVUyYRZZR3AuNQhuX" : {
        "-Ketnjygq-uxFxVSuUYF" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "ucmagency.org",
        "id" : "org8588.htm",
        "mission_statement" : "United Community Ministries (UCM), founded in 1969, works to assist families and individuals to improve the quality of their lives in a manner that builds their self-reliance and fosters their ability to function at the greatest level of their economic and social capacities. UCM provides services including emergency assistance, employment placement and training; developmental childcare, youth services, supportive housing services, homelessness prevention and child abuse and neglect prevention. In Fiscal Year 2010, the organization served over 14,000 program participants from over 5,000 households in twelve UCM programs. ",
        "name" : "United Community Ministries",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.ucmagency.org/"
      }
    },
    "org8611" : {
      "-KeaVVfpcuWZyus_6N7_" : {
        "-KfMja2Ql-_ybYm3Lyhk" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "mealsonwheelsgreenville.org",
        "id" : "org8611.htm",
        "mission_statement" : "Since 1968, Meals on Wheels has grown to a volunteer corps of more than 2,500 individual, group and corporate volunteers serving 1,500 meals daily throughout Greenville County. All of our clients are referred by a physician and there never has been a waiting list. Meals are provided free of charge and there is no financial qualification to receive meals. Our clients are homebound and physically or mentally challenged to a point where meal preparation is nearly impossible. Most clients live alone or with another incapacitated person. Volunteers monitor the welfare of the clients on their routes and serve as a link to other community-based services such as transportation, home health services, financial services and even home repair and handicap accessible modifications. Over the past forty-two years, Meals on Wheels has served more than nine million meals to people in need. ",
        "name" : "Meals on Wheels of Greenville",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Social Services",
        "url" : "http://www.mealsonwheelsgreenville.org"
      }
    },
    "org8640" : {
      "-KeaVUXD_BV14Mx3CgeC" : {
        "-KfMjc_0iOrpWDAhMGlV" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "soct.org",
        "id" : "org8640.htm",
        "mission_statement" : "Since 1969, Special Olympics Connecticut (SOCT) has provided year-round sports training and athletic competition for adults and children with intellectual disabilities. SOCT provides many vital programs, including the Unified Sports Program; the Connecticut Association of Schools/Connecticut Interscholastic Athletic Conference partnership; the Masters Sports Program for athletes 40 and older; and the Officials Program for Athletes. SOCT serves 8,984 athletes throughout the state. In order to provide the most inclusive and meaningful school and community based sports training and competition for its 5,292 athletes with intellectual disabilities, SOCT opens its doors and offers the opportunity to an additional 3,692 athletes who train and compete as partners alongside their peers with intellectual disabilities. ",
        "name" : "Special Olympics Connecticut",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Multipurpose Human Service Organizations",
        "url" : "http://www.soct.org/"
      }
    },
    "org8670" : {
      "-KeaVWtu7KmZ3K-l192P" : {
        "-KfMjfdYdR2jpjYn6GPv" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "sitarartscenter.org",
        "id" : "org8670.htm",
        "mission_statement" : "Founded in 1998, the Sitar Arts Center brings its diverse community together to give underserved children and youth the opportunity to explore and study the visual and performing arts in an afterschool safe haven. The Center partners with local volunteer artists and arts organizations to provide comprehensive arts education, nurturing relationships and high expectations that enable young people to better know and express themselves as they discover and develop their artistic gifts. Sitar Arts Center provides multidisciplinary arts education to the children and youth of Washington, DC in a nurturing, creative community where young people discover their inherent talents and gifts. ",
        "name" : "Sitar Arts Center",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.sitarartscenter.org/"
      }
    },
    "org8719" : {
      "-KeaVWhXtFU_s0QVw6Uu" : {
        "-KfMjtuH0thiFToCu2ht" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "balletwest.org",
        "id" : "org8719.htm",
        "mission_statement" : "Ballet West originated in Salt Lake City in 1963 as the Utah Civic Ballet. From Balanchine to Bournonville and Petipa to Tharp, Ballet West boasts a rich and varied repertoire, elegant and versatile artists and an American style and legacy that is as dynamic, expansive and unexpected as the Rocky Mountain region it represents. Ballet West has toured the world several times over presenting the very best in American classical ballet. The Ballet West Academy, the official school of Ballet West, provides excellence in ballet instruction to students ages 6-18. The Academy offers a structured curriculum that includes ballet technique, pointe, variations, character dance, classes for boys, adult classes and more. Each year, Ballet West Educational and Outreach programs serve more than 20 districts, over 320 schools and nearly 80,000 throughout the state. ",
        "name" : "Ballet West",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://www.balletwest.org/"
      }
    },
    "org8759" : {
      "-KeaVWYLJEnPLK1CRozn" : {
        "-KfMk-1AixZ7GcbFD1sl" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "habitatwc.org",
        "id" : "org8759.htm",
        "mission_statement" : "Habitat for Humanity of Westchester is an affiliate of Habitat for Humanity International, founded in 1976 by Millard and Linda Fuller and headquartered in Americus, Georgia. The Westchester affiliate was established in 1988. The concept of the organization is simple. Christians share an abundance, making available a portion of their resources for construction of modest, well-built homes for the poor. Building costs are kept to a minimum through volunteer labor, including that of the prospective owner, gifts of land, and donations from contractors, tradesmen, corporations and individuals. ",
        "name" : "Habitat for Humanity of Westchester",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Housing and Neighborhood Development",
        "url" : "http://www.habitatwc.org/"
      }
    },
    "org8773" : {
      "-KeaVVqOcJNj2n0-EKBE" : {
        "-KfMk1hfIEeGjk7H2PMv" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "swflcouncilbsa.org",
        "id" : "org8773.htm",
        "mission_statement" : "Boy Scouts of America, Southwest Florida Council, chartered in 1929, prepares young people to make ethical choices over their lifetimes by instilling in them the values of the Scout Oath and Law. The Southwest Florida Council provides a program that is fun for all eligible youth in our Council; and through the values of the Scout Oath and Law develops them into the future leaders of our communities. The Council currently has over 32,000 boys and girls ranging in ages from 7-20 years old involved in their programs. These programs are run by more than 4,000 adult volunteers. ",
        "name" : "Boy Scouts of America, Southwest Florida Council",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.swflcouncilbsa.org/"
      }
    },
    "org8808" : {
      "-KeaVV6DpLNMgbP_XDLH" : {
        "-KfMk4NJR3H_TbyfvT7b" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "varietystl.org",
        "id" : "org8808.htm",
        "mission_statement" : "Founded in 1932, the mission of Variety the Children's Charity of St. Louis is to serve children with physical and mental disabilities in the Greater St. Louis region whose needs would not be met were it not for Variety's sustained commitment. Variety serves these children each time they need assistance, from infancy to the age of 21, focusing on four core areas to help kids become independent and productive: gifting medical equipment for mobility and independence; developing unique education and recreational programs; and funding therapy. Variety partners with 75 agencies to support programs and give scholarships that directly impact the lives of Variety children.  ",
        "name" : "Variety the Children's Charity of St. Louis",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.varietystl.org"
      }
    },
    "org8869" : {
      "-KeaVVadTGJbEVZmwYiR" : {
        "-KfMkTAjHHnymQkGjzDd" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "craneschool.org",
        "id" : "org8869.htm",
        "mission_statement" : "Established in 1928, Crane Country Day School has remained true to the vision of its founders, offering rigorous academic programs with hands-on experiences that challenge both the intellect and the imagination. At Crane, we teach the whole child. We provide children with opportunities in academics, arts, sports, and community service. Involvement in these activities helps each child discover talents and strengths, which build every child's joy and confidence. Part of Crane's philosophy is a focus on hard work and personal responsibility. Crane's rigorous academic standards in combination with effective, individualized teaching methods allow us to challenge our students to move to the next level. We seek to inspire students to develop a deeper understanding of subject matter both in and beyond the classroom. ",
        "name" : "Crane Country Day School",
        "rater" : "n,MichaelHo",
        "type" : "Education : Private Elementary and Secondary Schools",
        "url" : "http://craneschool.org/"
      }
    },
    "org8929" : {
      "-KeaVVFleFWh34LbS1JU" : {
        "-KfMkVX9KDyM_VIiKbxi" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "roomtogrow.org",
        "id" : "org8929.htm",
        "mission_statement" : "Founded in 1998, the mission of Room to Grow is to enrich the lives of babies born into poverty throughout their critical first three years of development. Room to Grow's program provides parents raising babies in poverty with one-on-one parenting support and essential baby items throughout their children's critical first three years of life. Parents expecting a baby are referred to Room to Grow by selected prenatal programs assisting low-income families. Upon their referral, parents visit Room to Grow's warm and inviting space once every three months from just before the birth of the baby until their child turns three. During their one-on-one appointments with our staff clinicians, typically lasting two hours, parents receive developmental information, customized support, and all of the needed baby items to ensure a healthy and secure start for their child. ",
        "name" : "Room to Grow",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Children's and Family Services",
        "url" : "http://www.roomtogrow.org"
      }
    },
    "org8944" : {
      "-KeaVWoIomTMuX5gZcj7" : {
        "-KfMkrAMNhuWvCe2bE8C" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "spca914.org",
        "id" : "org8944.htm",
        "mission_statement" : "The SPCA of Westchester was founded in 1883. Today, it is the only humane society in Westchester County empowered to enforce laws relating to animal cruelty. The SPCA's services include shelter and rehabilitation for abused, abandoned, and lost animals; adoption services; low-cost veterinary services; cruelty investigations; community outreach programs; and lost and found services. The SPCA of Westchester is located on several acres, with four separate kennel areas for dogs, a cattery and feline pavilion for cats, and the Simpson Spay/Neuter Clinic. At the present time, the Shelter is equipped to house over 100 dogs and many, many cats. Since 1983, we have spayed/neutered almost 38,000 dogs and cats thereby greatly reducing the number of unwanted animals in Westchester County. ",
        "name" : "SPCA of Westchester",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Animal Rights, Welfare, and Services",
        "url" : "http://www.spca914.org"
      }
    },
    "org9159" : {
      "-KeaVSuPUy7u_G13f6bh" : {
        "-KfMkyMfSqunluYcDC-u" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "princeofwalesfdn.org",
        "id" : "org9159.htm",
        "mission_statement" : "The Prince of Wales Foundation (U.S.A.) was founded by HRH The Prince of Wales in 1997. The Foundation seeks to compliment the work of The Prince of Wales's Charitable Foundation (U.K.), and expand His Royal Highness's outreach to the United States and around the world. Since its inception, The Prince of Wales Foundation has grown to encompass an ever-broadening arena of interests and concerns. Funds raised by the Foundation support grants in the areas of education, arts and cultural programs, sustainable development in urban and rural communities and the environment. ",
        "name" : "The Prince of Wales Foundation",
        "rater" : "n,MichaelHo",
        "type" : "International : Foreign Charity Support Organizations",
        "url" : "http://princeofwalesfdn.org/aboutus.html"
      }
    },
    "org9255" : {
      "-KeaVSw-NMNUaX5Fxfsw" : {
        "-KfMlMvA6I3GPFIdrgCd" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "composersforum.org",
        "id" : "org9255.htm",
        "mission_statement" : "The American Composers Forum is committed to supporting composers and developing new markets for their music. Through granting, commissioning, and performance programs, the Forum provides composers at all stages of their careers with valuable resources for professional and artistic development. By linking communities with composers and performers, the Forum fosters a demand for new music, enriches communities, and helps develop the next generation of composers, musicians, and music patrons. Founded in 1973 as the Minnesota Composers Forum, the organization has grown from an innovative regional initiative into one of the nation's premier composer service organizations, reaching composers and communities in all 50 states. ",
        "name" : "American Composers Forum",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://composersforum.org/"
      }
    },
    "org9282" : {
      "-KeaVU_8Q6N4oupRVKrZ" : {
        "-KfMlP46v-4YChPPbgqU" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "ya-or.org",
        "id" : "org9282.htm",
        "mission_statement" : "Founded in 1958, Young Audiences of Oregon & SW Washington has evolved from presenting only a few classical music performances to currently providing a roster of over 200 skilled residency and performing artists with programs in multiple artistic disciplines and cultures. We connect these artists with classroom teachers and together they use the arts to make learning come alive for their students. Our mission is to enhance children's learning with creative resources from the arts community. Through Young Audiences' Run For The Arts, schools raise the funds that make it possible to bring artists into their classrooms, pay for field trips to see performances and exhibitions and purchase art supplies. ",
        "name" : "Young Audiences of Oregon & SW Washington",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://ya-or.org"
      }
    },
    "org9305" : {
      "-KeaVUXunDmRKjR59gaT" : {
        "-KfMlU4K-R30x3oqZF86" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "mtsgreenway.org",
        "id" : "org9305.htm",
        "mission_statement" : "Created in 1991, Mountains to Sound Greenway Trust protects and enhances a 100-mile corridor of permanent open space lands along Interstate 90 from Seattle to Central Washington. The Greenway embraces city parks and trails, wildlife habitat, working and protected forests, recreational opportunities in nature, local history, scenic beauty, tourism and educational activities that promote a balance between population growth, and a healthy environment. The Greenway Trust does not own land - instead, we work with public agencies and land conservation organizations to find funding and willing sellers to create this connected green landscape. ",
        "name" : "Mountains to Sound Greenway Trust",
        "rater" : "n,MichaelHo",
        "type" : "Environment : Environmental Protection and Conservation",
        "url" : "http://www.mtsgreenway.org"
      }
    },
    "org9309" : {
      "-KeaVVSsmwosHQFttGju" : {
        "-KfMlVpnIgDxWQZufCcT" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "operaamerica.org",
        "id" : "org9309.htm",
        "mission_statement" : "OPERA America is dedicated to supporting the creation, presentation and enjoyment of opera. OPERA America draws on resources and expertise from within and beyond the opera field to advance a mutually beneficial agenda that serves and strengthens the field through programs in the following categories: creation: artistic services that help artists and companies increase the creativity and excellence of opera productions, especially North American works; presentation: opera company services that address the specific needs of staff, trustees and volunteers; and enjoyment: education, audience development and community services that increase all forms of opera appreciation. Founded in 1970, OPERA America has an international membership that includes nearly 2,500 members and over 16,000 subscribers to its electronic news service. ",
        "name" : "OPERA America",
        "rater" : "n,MichaelHo",
        "type" : "Arts, Culture, Humanities : Performing Arts",
        "url" : "http://operaamerica.org"
      }
    },
    "org9358" : {
      "-KeaVUuAbPoiMjpSozGF" : {
        "-KfMlYK8KwvnjkeXMT5b" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "bnaizion.org",
        "id" : "org9358.htm",
        "mission_statement" : "Bnai Zion Foundation, a membership organization dedicated to assisting those in need with humanitarian projects in both Israel and America, has been in existence since 1908 and has completed hundreds of initiatives for the people of Israel and for Jewish people worldwide. Dedicated to American and Zionist ideals, Bnai Zion strongly supports the significant, enduring tie between America and Israel and is forging ahead with its efforts toward the advancement of the physical and social welfare of the Jewish people. ",
        "name" : "Bnai Zion Foundation",
        "rater" : "n,MichaelHo",
        "type" : "International : Foreign Charity Support Organizations",
        "url" : "http://www.bnaizion.org/"
      }
    },
    "org9375" : {
      "-KeaVWwQoIc_CDv8eSWf" : {
        "-KfMl_b8KRYwBdzK39FV" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "foodallergy.org",
        "id" : "org9375.htm",
        "mission_statement" : "Food Allergy Research & Education (FARE) works on behalf of the 15 million Americans with food allergies, including all those at risk for life-threatening anaphylaxis. This potentially deadly disease affects 1 in 13 children in the United States - or roughly two in every classroom. FARE is a 501(c)(3) nonprofit organization that was formed in 2012 as the result of a merger between the Food Allergy & Anaphylaxis Network and the Food Allergy Initiative. ",
        "name" : "Food Allergy Research & Education",
        "rater" : "n,MichaelHo",
        "type" : "Community Development : Fundraising",
        "url" : "http://www.foodallergy.org/"
      }
    },
    "org9386" : {
      "-KeaVWH-KqTtJ3NJzqL6" : {
        "-KfMlc2wbICRrjc6AAx2" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "tfas.org",
        "id" : "org9386.htm",
        "mission_statement" : "The Fund for American Studies (TFAS) seeks to create a brighter, more prosperous future by preparing young people for leadership, teaching them the ideas of freedom and a free-market economy. Our approach is to recruit young people likely to pursue careers in public policy, journalism, international affairs, business, government and related fields, and to educate them in the ideas most conducive to human achievement - individual liberty and personal responsibility. Founded in 1967, TFAS organizes programs in the United States, Europe, the Middle East, Asia and Latin America. ",
        "name" : "The Fund for American Studies",
        "rater" : "n,MichaelHo",
        "type" : "Education : Other Education Programs and Services",
        "url" : "http://www.tfas.org/"
      }
    },
    "org9525" : {
      "-KeaVVTaAG4DSU5YVR5r" : {
        "-KfMlh6ith0Ef_sES7wk" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rmhckc.org",
        "id" : "org9525.htm",
        "mission_statement" : "At Ronald McDonald House Charities, we strive to reduce the burden of childhood illness on children and their families. We provide temporary lodging in a home-like setting with private bedrooms, as well as dining, kitchen and recreational areas. Ronald McDonald House Charities serves families whose children are receiving care for a serious illness or injury at a Kansas City area hospital or treatment facility. Many of the children we serve are admitted to the hospital for: pediatric intensive care, burns, cardiac care, hematology, oncology and neo-natal intensive care. The first Kansas City Ronald McDonald House began in 1980 with the purchase of a three-story colonial home. The new Ronald McDonald House in Longfellow Park opened in 2006 and has 29 guest bedrooms and 12 long-term suites. ",
        "name" : "Ronald McDonald House Charities of Kansas City",
        "rater" : "n,MichaelHo",
        "type" : "Health : Patient and Family Support",
        "url" : "http://www.rmhckc.org/"
      }
    },
    "org9542" : {
      "-KeaVWaqRN1PnZ2pKwLB" : {
        "-KfMlislIaqxlL7m2kb-" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "wildcaremarin.org",
        "id" : "org9542.htm",
        "mission_statement" : "Founded in 1974, WildCare is a urban wildlife rehabilitation center. WildCare's mission is to advocate for wildlife for a sustainable world, and we actively pursue this mission through nature education, wildlife rehabilitation and community outreach. Through partnerships with schools, collaborations with other organizations, educational programs and activities, internships and volunteer opportunities we make a positive difference in our community. We work to make sure all species can coexist-- not just by treating sick or injured animals (over 3,000 of them a year), but also by teaching people how to live peacefully with wildlife and by advocating for better protection of wildlife and our remaining open spaces. ",
        "name" : "WildCare",
        "rater" : "n,MichaelHo",
        "type" : "Animals : Wildlife Conservation",
        "url" : "http://www.wildcaremarin.org"
      }
    },
    "org9829" : {
      "-KeaVT1_Y6WuWKHjHqCw" : {
        "-KfMllsQg2pvPHWkHjlb" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "wsm.org",
        "id" : "org9829.htm",
        "mission_statement" : "Since 1905 our purpose has been to advance the kingdom of God through the gospel of Jesus Christ and to do missionary, relief, and rescue work of all kinds. As the only year-round emergency shelter in Lancaster, PA, we believe homes, jobs and support are three critical answers for individuals who find themselves in the traumatic crisis of homelessness. However, to truly end cycles of homelessness, we have a vision to help individuals come to know lasting, life transformation. Then, they can break out of lifestyles that may have led to their homelessness. ",
        "name" : "Water Street Ministries",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Homeless Services",
        "url" : "http://wsm.org/"
      }
    },
    "org9855" : {
      "-KeaVUZLlvqbICzjs4SL" : {
        "-KfMlnr4nMoLTFDDA9_W" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "girlsincmemphis.org",
        "id" : "org9855.htm",
        "mission_statement" : "Girls Incorporated is a national youth organization dedicated to inspiring all girls to be strong, smart and bold. For more than 60 years, Girls Inc. of Memphis has responded to the changing needs of girls through programs, research and advocacy designed to build girls' skills and self-confidence. Girls Inc. of Memphis offers informal educational programs in six core areas: careers and life planning, health and sexuality, leadership and community action, sports and adventure, self-reliance and life skills, and culture and heritage. ",
        "name" : "Girls Inc. of Memphis",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Youth Development, Shelter, and Crisis Services",
        "url" : "http://www.girlsincmemphis.org"
      }
    },
    "org9864" : {
      "-KeaVUh43BXlzrozz0t-" : {
        "-KfMlrVda2bqd8lMGSL2" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "go-ministries.org",
        "id" : "org9864.htm",
        "mission_statement" : "Incorporated in 1996, G.O. Ministries is a Christian organization dedicated to the ministry of short-term missions and the development of partnerships of ministry. Our goal is to recruit, equip and coordinate people for short-term mission adventures that will mutually challenge each participant and support the inspiring efforts of National Christian leaders abroad. G.O. Ministries was established after its founder, Brook Brotzman, traveled to the Dominican Republic and Haiti and witnessed the extreme poverty and spiritual oppression there. In 2006, G.O. Ministries expanded into Mongolia, Colombia, Belize, and beyond. ",
        "name" : "G.O. Ministries",
        "rater" : "n,MichaelHo",
        "type" : "Religion : Religious Activities",
        "url" : "http://www.go-ministries.org/"
      }
    },
    "org9882" : {
      "-KeaVURQfQwIQDXRI8Ww" : {
        "-KfMlwd6oxMwiV_ukw5W" : {
          "MichaelHo" : "not_homeless_related"
        },
        "domain" : "rmhc-detroit.org",
        "id" : "org9882.htm",
        "mission_statement" : "Believing that every child deserves a safe and supportive place to grow, Ronald McDonald House Charities of Southeastern Michigan creates, finds and supports programs that directly improve the health and well being of children. We fulfill our mission by providing a home-away-from-home for families of seriously ill children, managing programs that help deliver health services to children in under-served communities, and by providing grants to nonprofit organizations for programs that enable seriously ill children to live happier, healthier lives. ",
        "name" : "Ronald McDonald House Charities of Southeastern Michigan",
        "rater" : "n,MichaelHo",
        "type" : "Health : Patient and Family Support",
        "url" : "http://www.rmhc-detroit.org/"
      }
    },
    "org9901" : {
      "-KeaVVxURsE6YFTwrqDm" : {
        "-KfMlz3grU9MBfnA2m7Q" : {
          "MichaelHo" : "homeless_related"
        },
        "domain" : "womenslunchplace.org",
        "id" : "org9901.htm",
        "mission_statement" : "Since 1982, thousands of Boston's poorest women have found refuge and welcome at the Women's Lunch Place. The Women's Lunch Place provides a safe, comfortable day time shelter, nutritious food, and services for women who are homeless or poor. We treat women with dignity and respect, and foster a community committed to meeting each woman's needs. We are open six days a week, year-round, to offer food, friendship, and a full spectrum of advocacy and support services to each of our guests. ",
        "name" : "The Women's Lunch Place",
        "rater" : "n,MichaelHo",
        "type" : "Human Services : Homeless Services",
        "url" : "http://www.womenslunchplace.org/"
      }
    },
    "undefined" : {
      "-KeaVVxURsE6YFTwrqDm" : {
        "-KfMm-MRRBN_sZJlo2yz" : {
          "MichaelHo" : "homeless_related"
        },
        "rater" : "n,MichaelHo,MichaelHo"
      }
    }
  }
}
